zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
/*
 * Copyright 2016,2020-2025 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */
#include "fsl_device_registers.h"
#include "fsl_common.h"
#include "fsl_power.h"
#include "fsl_system.h"
#include "fsl_rom_api.h"

#include "llhwc_cmn.h"
#include "reg_field_name_add.h"
#include "dslp_reg_field_name_add.h"
#include "evnt_schdlr.h"
#include "fsl_gpio.h"
#include "fsl_debug_console.h"

/*! @name Driver version */
/*@{*/
/*! @brief MCXW23 power control version. */
#define FSL_MCXW23_POWER_CONTROL_VERSION (MAKE_VERSION(2, 0, 0))
/*@}*/

/* The settling time in microseconds of the BOD. After changing BOD level, POWER_IsBODActive is only valid after this
 * time */
#define STABILIZATION_TIME_IN_US (40)

// defines that should have been in the header file

/*! LPMODE - Power Mode Control.
 *  0b00..ACTIVE power mode.
 *  0b01..DEEP SLEEP low power mode.
 *  0b10..POWER DOWN low power mode.
 *  0b11..DEEP POWER DOWN low power mode.
 */
#define PMC_CTRL_LPMODE_ACTIVE          (0U)
#define PMC_CTRL_LPMODE_DEEP_SLEEP      (1U)
#define PMC_CTRL_LPMODE_POWER_DOWN      (2U)
#define PMC_CTRL_LPMODE_DEEP_POWER_DOWN (3U)

/*! SELCLOCK - Select the Power Management Controller (PMC) functional clock : .
 *  0b00..1 MHz Free Running Oscillator.
 *  0b01..12 MHz Free Running Oscillator.
 *  0b10..32kHz RTC clock.
 */
#define PMC_CTRL_SELCLOCK_1MHZ_FRO        (0U)
#define PMC_CTRL_SELCLOCK_12MHZ_FRO       (1U)
#define PMC_CTRL_SELCLOCK_32kHZ_RTC_CLOCK (2U)

/*! PDEN_BIAS - Enable or disable bandgap in high or low power mode.
 *  0b00..Bias 0.66V low power mode enabled. This is intended to be used for retention mode of memory or digital
 *  0b01..Bias 0.63V high accuracy mode enabled. During active mode, the bias must be set in high accuracy mode
 *  0b1x..Bias disabled.
 */
#define PMC_PDSLEEPCFG0_PDEN_BIAS_0_66     (0 << PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT)
#define PMC_PDSLEEPCFG0_PDEN_BIAS_0_63     (1 << PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT)
#define PMC_PDSLEEPCFG0_PDEN_BIAS_DISABLED (2 << PMC_PDSLEEPCFG0_PDEN_BIAS_SHIFT)

/*******************
 * EXPORTED MACROS  *
 ********************/

/* Low Power modes  */
#define LOWPOWER_CTRL_LPMODE_INDEX   PMC_CTRL_LPMODE_SHIFT
#define LOWPOWER_CTRL_LPMODE_MASK    PMC_CTRL_LPMODE_MASK
#define LOWPOWER_CTRL_SELCLOCK_INDEX PMC_CTRL_SELCLOCK_SHIFT
#define LOWPOWER_CTRL_SELCLOCK_MASK  PMC_CTRL_SELCLOCK_MASK
#define LOWPOWER_CTRL_POFFMODE_INDEX PMC_CTRL_POFFMODE_SHIFT
#define LOWPOWER_CTRL_POFFMODE_MASK  PMC_CTRL_POFFMODE_MASK

#define LOWPOWER_CTRL_LPMODE_ACTIVE        0 /*!< ACTIVE mode          */
#define LOWPOWER_CTRL_LPMODE_DEEPSLEEP     1 /*!< DEEP SLEEP mode      */
#define LOWPOWER_CTRL_LPMODE_POWERDOWN     2 /*!< POWER DOWN mode      */
#define LOWPOWER_CTRL_LPMODE_DEEPPOWERDOWN 3 /*!< DEEP POWER DOWN mode */

#define LOWPOWER_CTRL_SELCLOCK_1MHZ 0 /*!< The 1 MHz clock is used during the configuration of the PMC */
#define LOWPOWER_CTRL_SELCLOCK_12MHZ \
    1 /*!< The 12 MHz clock is used during the configuration of the PMC (to speed up PMC configuration process)*/
#define LOWPOWER_CTRL_SELCLOCK_32KHZ 2 /*!< 32kHz clock */

#define LOWPOWER_CTRL_POFFMODE_OFF 0 /*!< Power mode defined by LPMODE */
#define LOWPOWER_CTRL_POFFMODE_ON  1 /*!< Power off */

/* exclude_from_pd direct hardware bits mask */
#define EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK                                                                    \
    (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2 | kLOWPOWERCFG_FRO1M | kLOWPOWERCFG_FRO192M | \
     kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K | kLOWPOWERCFG_TRNG)

/**
 * @brief Wake up timers configuration in Low Power Modes
 */
#define LOWPOWER_TIMERCFG_CTRL_INDEX   0
#define LOWPOWER_TIMERCFG_CTRL_MASK    (0x1UL << LOWPOWER_TIMERCFG_CTRL_INDEX)
#define LOWPOWER_TIMERCFG_TIMER_INDEX  1
#define LOWPOWER_TIMERCFG_TIMER_MASK   (0x7UL << LOWPOWER_TIMERCFG_TIMER_INDEX)
#define LOWPOWER_TIMERCFG_OSC32K_INDEX 4
#define LOWPOWER_TIMERCFG_OSC32K_MASK  (0x1UL << LOWPOWER_TIMERCFG_OSC32K_INDEX)

#define LOWPOWER_TIMERCFG_CTRL_DISABLE 0 /*!< Wake Timer Disable */
#define LOWPOWER_TIMERCFG_CTRL_ENABLE  1 /*!< Wake Timer Enable  */

/**
 * @brief Primary Wake up timers configuration in Low Power Modes
 */
#define LOWPOWER_TIMERCFG_TIMER_RTC1KHZ 0 /*!< 1 KHz Real Time Counter (RTC) used as wake up source */
#define LOWPOWER_TIMERCFG_TIMER_RTC1HZ  1 /*!< 1 Hz Real Time Counter (RTC) used as wake up source  */
#define LOWPOWER_TIMERCFG_TIMER_OSTIMER 2 /*!< OS Event Timer used as wake up source                */

#define LOWPOWER_TIMERCFG_OSC32K_FRO32KHZ  0 /*!< Wake up Timers uses FRO 32 KHz as clock source      */
#define LOWPOWER_TIMERCFG_OSC32K_XTAL32KHZ 1 /*!< Wake up Timers uses Chrystal 32 KHz as clock source */

/*
 * defines for functions uint32_t CLOCK_GetCoreSysClkConfiguration(void) and void
 * CLOCK_SetCoreSysClkConfiguration(uint32_t configuration);
 */
#define SYSCON_MAINCLKSELA_SEL_BITS               3
#define SYSCON_MAINCLKSELB_SEL_BITS               3
#define SYSCON_AHBCLKDIV_DIV_BITS                 8
#define ANACTRL_FRO192M_CTRL_ENA_BITS             5
#define SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS          1
#define SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS 1
#define PMC_PDRUNCFG0_PDEN_FRO192M_BITS           1

#define CONFIGURATION_SYSCON_MAINCLKSELA_SHIFT       (0)
#define CONFIGURATION_SYSCON_MAINCLKSELB_SHIFT       (CONFIGURATION_SYSCON_MAINCLKSELA_SHIFT + SYSCON_MAINCLKSELA_SEL_BITS)
#define CONFIGURATION_SYSCON_AHBCLKDIV_SHIFT         (CONFIGURATION_SYSCON_MAINCLKSELB_SHIFT + SYSCON_MAINCLKSELB_SEL_BITS)
#define CONFIGURATION_ANACTRL_FRO192M_CTRL_ENA_SHIFT (CONFIGURATION_SYSCON_AHBCLKDIV_SHIFT + SYSCON_AHBCLKDIV_DIV_BITS)
#define CONFIGURATION_SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT \
    (CONFIGURATION_ANACTRL_FRO192M_CTRL_ENA_SHIFT + ANACTRL_FRO192M_CTRL_ENA_BITS)
#define CONFIGURATION_SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT \
    (CONFIGURATION_SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT + SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS)
#define CONFIGURATION_PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT \
    (CONFIGURATION_SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT + SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS)

#define CPU_RETENTION_RAMX_STORAGE_START_ADDR (0x4002000) //  beginning of SRAM_X2

#define XO_SLAVE_EN (1)

typedef enum dcdc_exclude_config_s
{
    kDCDC_EXCLUDE_CONFIG_A0_A1_A2 = 0U,
    kDCDC_EXCLUDE_CONFIG_A3_A4    = 1U,
    kDCDC_EXCLUDE_CONFIG_A5       = 2U,
    kDCDC_EXCLUDE_CONFIG_COUNT    = 3U,
} dcdc_exclude_config_t;

typedef enum ldo_dig_vadj_s
{
    kLDO_DIG_900mv  = 0U,
    kLDO_DIG_950mv  = 1U,
    kLDO_DIG_1000mv = 2U,
    kLDO_DIG_1050mv = 3U,
} ldo_dig_vadj_t;

