zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
typedef enum ldo_mem_vadj_s
{
    kLDO_MEM_900mv  = 0U,
    kLDO_MEM_950mv  = 1U,
    kLDO_MEM_1000mv = 2U,
    kLDO_MEM_1050mv = 3U,
} ldo_mem_vadj_t;

/*
 * AOREG1 defines that match with bootloader
 */
#define kAOREG1_DCDC_MODE_XR_SM_SS_SHIFT (24)
#define kAOREG1_DCDC_MODE_XR_SM_SS_MASK  (1 << kAOREG1_DCDC_MODE_XR_SM_SS_SHIFT)
#define kAOREG1_DCDC_MODE_XR_SM_DS_SHIFT (25)
#define kAOREG1_DCDC_MODE_XR_SM_DS_MASK  (1 << kAOREG1_DCDC_MODE_XR_SM_DS_SHIFT)

#define kAOREG1_BOD1_SHIFT (26)
#define kAOREG1_BOD1_MASK  (1 << kAOREG1_BOD1_SHIFT)
#define kAOREG1_BOD2_SHIFT (27)
#define kAOREG1_BOD2_MASK  (1 << kAOREG1_BOD2_SHIFT)

/* On silicon A0 and A2 silicon, when in XRSM mode, startup value of DC/DC was important for further configuration,
that's why the variants XR_SS_BOOST/XR_SS_BUCK/DS_BOOST/DS_BUCK exist (they have nothing to do with actual buck or
boost). From A3 onwards, when in XRSM mode, DC/DC always startups in Buck. */
typedef enum supply_mode_s
{
    kSUPPLY_MODE_HV_SM       = 0U,
    kSUPPLY_MODE_XR_SS_BOOST = 1U,
    kSUPPLY_MODE_XR_SS_BUCK  = 2U,
    kSUPPLY_MODE_XR_DS_BOOST = 3U,
    kSUPPLY_MODE_XR_DS_BUCK  = 4U,
    kSUPPLY_MODE_LV_SM       = 5U,
    kSUPPLY_MODE_COUNT       = 6U,
} supply_mode_t;

typedef enum lp_mode_s
{
    kLP_MODE_DEEPSLEEP     = 0U,
    kLP_MODE_POWERDOWN     = 1U,
    kLP_MODE_DEEPPOWERDOWN = 2U,
    kLP_MODE_POWEROFF      = 3U,
    kLP_MODE_COUNT         = 4U,
} lp_mode_t;

/* Code relies on order/values */
typedef enum DCDC_exclude_mode_s
{
    kDCDC_EXCLUDE_NONE   = 0U,
    kDCDC_EXCLUDE_DCDC   = 1U,
    kDCDC_EXCLUDE_BYPASS = 2U,
    kDCDC_EXCLUDE_BOTH   = 3U,
    kDCDC_EXCLUDE_COUNT  = 4U,
} DCDC_exclude_mode_t;

/**
 * @brief List of DC/DC modes
 * defines must match with dcdc_mode_t
 */
typedef enum dcdc_hw_mode_s
{
    kDCDC_HW_MODE_HV_SM = 1U, /*!< HV supplied */
    kDCDC_HW_MODE_LV_SM = 2U, /*!< LV supplied */
} dcdc_hw_mode_t;

typedef status_t (*POWER_DCDC_exclude_function_t)(uint32_t *exclude_from_pd);

/*******************************************************************************
 * Global variables
 ******************************************************************************/
#define DEFAULT_FRO_STARTUP_DELAY  (100) /* in ms */
#define DEFAULT_XTAL_STARTUP_DELAY (500) /* in ms */
static uint32_t POWER_XTALStartupTime = DEFAULT_XTAL_STARTUP_DELAY;

/*******************************************************************************
 * Static functions
 ******************************************************************************/
static void POWER_delay_us(uint32_t delay)
{
#ifdef DEBUG
    if (SystemCoreClock == kFreq_12MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_24MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_32MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
#else
    if (SystemCoreClock == kFreq_12MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_24MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
    else if (SystemCoreClock == kFreq_32MHz)
    {
        while (delay--)
        {
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
            __NOP();
        }
    }
#endif
}

static void POWER_delay_ms(uint32_t delay)
{
    POWER_delay_us(delay * 1000);
}

static void POWER_SavePinRegisters(void)
{
#define IOCON_GPIO_FUNC12 0xC

    uint32_t *cpu_ret_store_ptr =
        (uint32_t *)(CPU_RETENTION_RAMX_STORAGE_START_ADDR + 0x900); // size 25*4=100 (0x64)  0x900 - 0x964
    uint32_t pinsDir = GPIO->DIR[0];

    *cpu_ret_store_ptr++ = pinsDir;
    *cpu_ret_store_ptr++ = GPIO->PIN[0];
    for (uint32_t i = 0; i <= 22; i++)
    {
        *cpu_ret_store_ptr++ = IOCON->PIO[0][i];
        /* Set all pins that are configured as output, temporary to FUNC12 before going to lower power
        to avoid a 120ns pulse during wakeup from power down. (see HCIOT-4852 and artf1215149) */
        if ((pinsDir & (1 << i)) > 0)
        {
            IOCON->PIO[0][i] = (IOCON->PIO[0][i] & ~IOCON_PIO_FUNC_MASK) | (IOCON_GPIO_FUNC12 & IOCON_PIO_FUNC_MASK);
        }
    }
}

static void POWER_RestorePinRegisters(void)
{
    uint32_t *cpu_ret_store_ptr = (uint32_t *)(CPU_RETENTION_RAMX_STORAGE_START_ADDR + 0x900);
    GPIO->DIR[0]                = *cpu_ret_store_ptr++;
    GPIO->PIN[0]                = *cpu_ret_store_ptr++;
    for (uint32_t i = 0; i <= 22; i++)
    {
        IOCON->PIO[0][i] = *cpu_ret_store_ptr++;
    }
}
/*
 * Complete sys clock configuration consists of settings in
 * MAINCLKSELA, MAINCLKSELB, AHBCLKDIV, PDRUNCFG, FRO192M_CTRL
 * This function reads the actual settings and returns them in a 32-bit word to be used in
 * CLOCK_SetCoreSysClkConfiguration
 */
static uint32_t CLOCK_GetCoreSysClkConfiguration(void)
{
    uint32_t return_value = 0;
    uint32_t pos          = 0;
    return_value |= ((SYSCON->MAINCLKSELA & SYSCON_MAINCLKSELA_SEL_MASK) << pos);
    pos += SYSCON_MAINCLKSELA_SEL_BITS;
    return_value |= ((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) << pos);
    pos += SYSCON_MAINCLKSELB_SEL_BITS;
    return_value |= ((SYSCON->AHBCLKDIV & SYSCON_AHBCLKDIV_DIV_MASK) << pos);
    pos += SYSCON_AHBCLKDIV_DIV_BITS;
    return_value |=
        (((ANACTRL->FRO192M_CTRL & (ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_MASK | ANACTRL_FRO192M_CTRL_ENA_24MHZCLK_MASK |
                                    ANACTRL_FRO192M_CTRL_ENA_32MHZCLK_MASK | ANACTRL_FRO192M_CTRL_ENA_48MHZCLK_MASK |
                                    ANACTRL_FRO192M_CTRL_ENA_64MHZCLK_MASK)) >>
          ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_SHIFT)
         << pos);
    pos += ANACTRL_FRO192M_CTRL_ENA_BITS;
    return_value |=
        (((SYSCON->CLOCK_CTRL & SYSCON_CLOCK_CTRL_CLKIN_ENA_MASK) >> SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT) << pos);
    pos += SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS;
    return_value |= (((SYSCON->CLOCK_CTRL & SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_MASK) >>
                      SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT)
                     << pos);
    pos += SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS;
    return_value |= (((PMC->PDRUNCFG0 & PMC_PDRUNCFG0_PDEN_FRO192M_MASK) >> PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT) << pos);
    // most probably no need to add PDEN_FRO1M, PDEN_XTAL32K, PDEN_FRO32K here
    return return_value;
}

