zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
/*
 * This function restores the actual Sys Clock configuration settings as readn by CLOCK_GetCoreSysClkConfiguration
 */
static void CLOCK_SetCoreSysClkConfiguration(uint32_t configuration)
{
    PMC->PDRUNCFG0 = (PMC->PDRUNCFG0 & ~PMC_PDRUNCFG0_PDEN_FRO192M_MASK) |
                     ((configuration >> CONFIGURATION_PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT) &
                      ((1 << PMC_PDRUNCFG0_PDEN_FRO192M_BITS) - 1))
                         << PMC_PDRUNCFG0_PDEN_FRO192M_SHIFT;

    SYSCON->CLOCK_CTRL = (SYSCON->CLOCK_CTRL & ~SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_MASK) |
                         ((configuration >> CONFIGURATION_SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT) &
                          ((1 << SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_BITS) - 1))
                             << SYSCON_CLOCK_CTRL_ANA_FRO12M_CLK_ENA_SHIFT;

    SYSCON->CLOCK_CTRL = (SYSCON->CLOCK_CTRL & ~SYSCON_CLOCK_CTRL_CLKIN_ENA_MASK) |
                         ((configuration >> CONFIGURATION_SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT) &
                          ((1 << SYSCON_CLOCK_CTRL_CLKIN_ENA_BITS) - 1))
                             << SYSCON_CLOCK_CTRL_CLKIN_ENA_SHIFT;

    ANACTRL->FRO192M_CTRL =
        ((configuration >> CONFIGURATION_ANACTRL_FRO192M_CTRL_ENA_SHIFT) & ((1 << ANACTRL_FRO192M_CTRL_ENA_BITS) - 1))
        << ANACTRL_FRO192M_CTRL_ENA_12MHZCLK_SHIFT;
    SYSCON->AHBCLKDIV   = (configuration >> CONFIGURATION_SYSCON_AHBCLKDIV_SHIFT) & SYSCON_AHBCLKDIV_DIV_MASK;
    SYSCON->MAINCLKSELB = (configuration >> CONFIGURATION_SYSCON_MAINCLKSELB_SHIFT) & SYSCON_MAINCLKSELB_SEL_MASK;
    SYSCON->MAINCLKSELA = configuration & SYSCON_MAINCLKSELA_SEL_MASK;
}

static status_t POWER_Bypass(uint32_t *exclude_from_pd)
{
    /* set enable LPBS request */
    PMC->DCDC0 |= PMC_DCDC0_ENABLE_BYPASS_MASK;
    /* disable DCDC during low power mode */
    *exclude_from_pd &= ~kLOWPOWERCFG_DCDC;
    return kStatus_Success;
}

static status_t POWER_On(uint32_t *exclude_from_pd)
{
    /* disable LPBS */
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;
    /* enable DCDC during low power mode */
    *exclude_from_pd |= kLOWPOWERCFG_DCDC;
    return kStatus_Success;
}

static status_t POWER_Off(uint32_t *exclude_from_pd)
{
    /* disable LPBS */
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;
    /* disable DCDC during low power mode */
    *exclude_from_pd &= ~kLOWPOWERCFG_DCDC;
    return kStatus_Success;
}

static status_t POWER_OnAndBypass(uint32_t *exclude_from_pd)
{
    /* set enable LPBS request */
    PMC->DCDC0 |= PMC_DCDC0_ENABLE_BYPASS_MASK;
    /* enable DCDC during low power mode */
    *exclude_from_pd |= kLOWPOWERCFG_DCDC;
    return kStatus_Success;
}

static status_t POWER_Error(uint32_t *exclude_from_pd)
{
    return kStatus_Fail;
}

static status_t POWER_Disabled(uint32_t *exclude_from_pd)
{
    return kStatus_Fail;
}

static status_t POWER_CannotBeUsed(uint32_t *exclude_from_pd)
{
    return kStatus_Fail;
}

static status_t POWER_InvalidArgument(uint32_t *exclude_from_pd)
{
    return kStatus_InvalidArgument;
}

/*
 * - On A0 and A2 (A1 does not exist), both Boost and Buck are supported.
 * - On A3 and A4, Boost is not available in HW. Table bellow will return error.
 * - On A5, Buck is not available in HW. Table bellow will return error.
 */
static const POWER_DCDC_exclude_function_t
    POWER_DCDC_exclude_function[kDCDC_EXCLUDE_CONFIG_COUNT][kLP_MODE_COUNT][kSUPPLY_MODE_COUNT][kDCDC_EXCLUDE_COUNT] = {
        /* A0, A1 and A2 */
        {{
             /* DEEPSLEEP */
             {POWER_Bypass, POWER_On, POWER_Bypass, POWER_InvalidArgument},        /* kSUPPLY_MODE_HV_SM */
             {POWER_Bypass, POWER_On, POWER_Bypass, POWER_InvalidArgument},        /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_OnAndBypass, POWER_Error, POWER_Error, POWER_InvalidArgument}, /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},         /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_CannotBeUsed, POWER_CannotBeUsed, POWER_CannotBeUsed,
              POWER_CannotBeUsed},                                       /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument}, /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* POWERDOWN */
             {POWER_Bypass, POWER_On, POWER_Bypass, POWER_InvalidArgument},        /* kSUPPLY_MODE_HV_SM */
             {POWER_Bypass, POWER_On, POWER_Bypass, POWER_InvalidArgument},        /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_OnAndBypass, POWER_Error, POWER_Error, POWER_InvalidArgument}, /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},         /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_CannotBeUsed, POWER_CannotBeUsed, POWER_CannotBeUsed,
              POWER_CannotBeUsed},                                       /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument}, /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* DEEPPOWERDOWN */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument},           /* kSUPPLY_MODE_HV_SM */
             {POWER_Bypass, POWER_On, POWER_Bypass, POWER_InvalidArgument},        /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_OnAndBypass, POWER_Error, POWER_Error, POWER_InvalidArgument}, /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},         /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_CannotBeUsed, POWER_CannotBeUsed, POWER_CannotBeUsed,
              POWER_CannotBeUsed},                                       /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument}, /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* POWEROFF */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},   /* kSUPPLY_MODE_HV_SM */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},   /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},   /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},   /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Error, POWER_Error, POWER_Error, POWER_InvalidArgument}, /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},   /* kSUPPLY_MODE_LV_SM */
         }},
        /* A3 and A4 */
        {{
             /* DEEPSLEEP */
             {POWER_Bypass, POWER_On, POWER_Bypass, POWER_InvalidArgument},    /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* POWERDOWN */
             {POWER_Bypass, POWER_On, POWER_Bypass, POWER_InvalidArgument},    /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* DEEPPOWERDOWN */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument},       /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* POWEROFF */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_LV_SM */
         }},
        /* A5 */
        {{
             /* DEEPSLEEP */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument},       /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* POWERDOWN */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument},       /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* DEEPPOWERDOWN */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_On, POWER_Bypass, POWER_InvalidArgument},       /* kSUPPLY_MODE_LV_SM */
         },
         {
             /* POWEROFF */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_HV_SM */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_SS_BUCK */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BOOST */
             {POWER_Disabled, POWER_Disabled, POWER_Disabled, POWER_Disabled}, /* kSUPPLY_MODE_XR_DS_BUCK */
             {POWER_Off, POWER_Error, POWER_Error, POWER_InvalidArgument},     /* kSUPPLY_MODE_LV_SM */
         }}};

