zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
static status_t POWER_SetPowerConfiguration(lp_mode_t lp_mode, uint32_t *exclude_from_pd)
{
    chip_version_t version = SYSTEM_GetChipVersion();
    dcdc_mode_t mode       = POWER_DCDC_GetSupplyMode();
    dcdc_hw_mode_t hw_mode =
        (dcdc_hw_mode_t)((PMC->STATUSPWR & PMC_STATUSPWR_DCDCMODE_MASK) >> PMC_STATUSPWR_DCDCMODE_SHIFT);
    status_t status = kStatus_Success;
    dcdc_exclude_config_t dcdc_exclude_config;

    DCDC_exclude_mode_t dcdc_exclude = kDCDC_EXCLUDE_NONE;
    if (*exclude_from_pd & kLOWPOWERCFG_DCDC_BYPASS)
    {
        dcdc_exclude |= kDCDC_EXCLUDE_BYPASS;
    }
    if (*exclude_from_pd & kLOWPOWERCFG_DCDC)
    {
        dcdc_exclude |= kDCDC_EXCLUDE_DCDC;
    }

    /* Translate chip_version_t into number to use in lookup table */
    if (version <= kCHIPVERSION_A2)
    {
        dcdc_exclude_config = kDCDC_EXCLUDE_CONFIG_A0_A1_A2;
    }
    else if (version > kCHIPVERSION_A2 && version <= kCHIPVERSION_A4)
    {
        dcdc_exclude_config = kDCDC_EXCLUDE_CONFIG_A3_A4;
    }
    else if (version > kCHIPVERSION_A4 && version <= kCHIPVERSION_A5)
    {
        dcdc_exclude_config = kDCDC_EXCLUDE_CONFIG_A5;
    }
    else
    {
        return kStatus_Power_ChipVersionNotSupported;
    }

    /********************************* BUCK MODE *********************************/
    if (mode == kDCDC_MODE_HV_SM)
    {
        status = POWER_DCDC_exclude_function[dcdc_exclude_config][lp_mode][kSUPPLY_MODE_HV_SM][dcdc_exclude](
            exclude_from_pd);
    }
    /********************************* XRSM SS MODE *********************************/
    else if (mode == kDCDC_MODE_XR_SM_SS)
    {
        /* XRSM mode but pmc started up as boost but actual mode is XRSM) */
        if (hw_mode == kDCDC_HW_MODE_LV_SM)
        {
            status = POWER_DCDC_exclude_function[dcdc_exclude_config][lp_mode][kSUPPLY_MODE_XR_SS_BOOST][dcdc_exclude](
                exclude_from_pd);
        }
        /* XRSM mode but pmc started up as buck but actual mode is XRSM) */
        else if (hw_mode == kDCDC_HW_MODE_HV_SM)
        {
            status = POWER_DCDC_exclude_function[dcdc_exclude_config][lp_mode][kSUPPLY_MODE_XR_SS_BUCK][dcdc_exclude](
                exclude_from_pd);
        }
    }
    /********************************* XRSM DS MODE *********************************/
    else if (mode == kDCDC_MODE_XR_SM_DS)
    {
        /* XRSM mode but pmc started up as boost but actual mode is XRSM) */
        if (hw_mode == kDCDC_HW_MODE_LV_SM)
        {
            status = POWER_DCDC_exclude_function[dcdc_exclude_config][lp_mode][kSUPPLY_MODE_XR_DS_BOOST][dcdc_exclude](
                exclude_from_pd);
        }
        /* XRSM mode but pmc started up as buck but actual mode is XRSM) */
        else if (hw_mode == kDCDC_HW_MODE_HV_SM)
        {
            status = POWER_DCDC_exclude_function[dcdc_exclude_config][lp_mode][kSUPPLY_MODE_XR_DS_BUCK][dcdc_exclude](
                exclude_from_pd);
        }
    }
    /********************************* BOOST MODE *********************************/
    else if (mode == kDCDC_MODE_LV_SM)
    {
        status = POWER_DCDC_exclude_function[dcdc_exclude_config][lp_mode][kSUPPLY_MODE_LV_SM][dcdc_exclude](
            exclude_from_pd);
    }

    return status;
}

static void EnableBOD1Interrupts(void)
{
    uint32_t int_ctrl = ANACTRL->BOD_DCDC_INT_CTRL;
    int_ctrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = int_ctrl;
}

static void DisableBOD1Interrupts(void)
{
    uint32_t int_ctrl = ANACTRL->BOD_DCDC_INT_CTRL;
    int_ctrl &= ~ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = int_ctrl;
}

static void EnableBOD1Resets(void)
{
    uint32_t reset_ctrl = PMC->RESETCTRL;
    reset_ctrl &= (~(PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK));
    reset_ctrl |= (1 << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT | 1 << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = reset_ctrl;
}

static void DisableBOD1Resets(void)
{
    // note: direct clear and modify in the register triggers a hard reset in simulation.
    uint32_t reset_ctrl = PMC->RESETCTRL;
    reset_ctrl &= (~(PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK));
    reset_ctrl |= (2 << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT | 2 << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = reset_ctrl;
}

static void EnableBOD2Interrupts(void)
{
    uint32_t int_ctrl = ANACTRL->BOD_DCDC_INT_CTRL;
    int_ctrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = int_ctrl;
}

static void DisableBOD2Interrupts(void)
{
    uint32_t int_ctrl = ANACTRL->BOD_DCDC_INT_CTRL;
    int_ctrl &= ~ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_ENABLE_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = int_ctrl;
}

static void EnableBOD2Resets(void)
{
    uint32_t reset_ctrl = PMC->RESETCTRL;
    reset_ctrl &= (~(PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK));
    reset_ctrl |= (1 << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT | 1 << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = reset_ctrl;
}

static void DisableBOD2Resets(void)
{
    // note: direct clear and modify in the register triggers a hard reset in simulation.
    uint32_t reset_ctrl = PMC->RESETCTRL;
    reset_ctrl &= (~(PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK));
    reset_ctrl |= (2 << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT | 2 << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT);
    PMC->RESETCTRL = reset_ctrl;
}

static uint32_t AdjustedLevelRegisterSetting(bod_level_t level, uint8_t offset)
{
    int8_t signed_offset = offset;
    int8_t adjusted_hysteresis;
    uint8_t adjusted_triglvl = ((level & PMC_BOD1_TRIGLVL_MASK) >> PMC_BOD1_TRIGLVL_SHIFT);
    uint8_t adjusted_lvlsel  = ((level & PMC_BOD1_LVLSEL_MASK) >> PMC_BOD1_LVLSEL_SHIFT);

    /* offset is 5 bits 2-complement encoded */
    if (offset & 0x10)
    {
        signed_offset -= 0x20;
    }

    /* level contains the register value to be set in the BODx register. We calculate the adjusted_hysteresis
     * from the hysteresis setting, the lvlsel setting and the offset. We extend the definition beyond 0 - 3 with
     * -5 for -100mV, -4 for -75mV, -3 for -50mV, -2 for -25mV, -1 for 0mV, 5 for +125mV, 6 for +150mV and 7 for +175mV.
     */
    if (adjusted_lvlsel == 1)
    {
        adjusted_hysteresis = -1;
    }
    else
    {
        adjusted_hysteresis = ((level & PMC_BOD1_HYST_MASK) >> PMC_BOD1_HYST_SHIFT);
    }
    adjusted_hysteresis -= signed_offset;

