zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    if (adjusted_triglvl > 10) /* triglvl has steps of 100mV for setting 10 and above */
    {
        if (adjusted_hysteresis < -1)
        {
            adjusted_hysteresis += 4;
            adjusted_triglvl -= 1;
        }
        if (adjusted_hysteresis > 3)
        {
            adjusted_hysteresis -= 4;
            adjusted_triglvl += 1;
        }
    }
    else
    {
        if (adjusted_triglvl == 10) /* triglvl has steps for setting 10 of 100mV upwards and 50mV downwards */
        {
            if (adjusted_hysteresis < -3)
            {
                adjusted_hysteresis += 2;
                adjusted_triglvl -= 1;
            }
            if (adjusted_hysteresis < -1)
            {
                adjusted_hysteresis += 2;
                adjusted_triglvl -= 1;
            }
            if (adjusted_hysteresis > 3)
            {
                adjusted_hysteresis -= 4;
                adjusted_triglvl += 1;
            }
        }
        else /* triglvl has steps of 50mV for setting 9 and below */
        {
            if (adjusted_hysteresis < -3)
            {
                adjusted_hysteresis += 2;
                adjusted_triglvl -= 1;
            }
            if (adjusted_hysteresis < -1)
            {
                adjusted_hysteresis += 2;
                adjusted_triglvl -= 1;
            }
            if (adjusted_hysteresis > 5)
            {
                adjusted_hysteresis -= 2;
                adjusted_triglvl += 1;
            }
            if (adjusted_hysteresis > 3)
            {
                adjusted_hysteresis -= 2;
                adjusted_triglvl += 1;
            }
        }
    }

    /* To add 0mV we have to set adjusted_lvlsel to 1, otherwise it must be set to 0. */
    if (adjusted_hysteresis == -1)
    {
        adjusted_hysteresis = 0;
        adjusted_lvlsel     = 1;
    }
    else
    {
        adjusted_lvlsel = 0;
    }

    return (uint32_t)((adjusted_lvlsel << PMC_BOD1_LVLSEL_SHIFT) | (adjusted_hysteresis << PMC_BOD1_HYST_SHIFT) |
                      (adjusted_triglvl << PMC_BOD1_TRIGLVL_SHIFT));
}
/* Below is test code for the AdjustedLevelRegisterSetting function. You can call TestAdjustedLevelRegisterSetting()
 * from the pmc_sandbox app. */
#if 0
extern void SysTick_DelayTicks(uint32_t n);
static uint32_t BodRegisterToMilliVolt(uint32_t regValue)
{
    uint32_t voltage;
    uint32_t triglvl = ((regValue & PMC_BOD1_TRIGLVL_MASK) >> PMC_BOD1_TRIGLVL_SHIFT);
    uint32_t hyst = ((regValue & PMC_BOD1_HYST_MASK) >> PMC_BOD1_HYST_SHIFT);

    if ((regValue & PMC_BOD1_MODE_MASK) || (triglvl > 26))
    {
        PRINTF("INVALID REGVALUE\n");
        return 0;
    }

    if (triglvl <= 10)
    {
        voltage = 1000 + (triglvl * 50);
    }
    else
    {
        voltage = 1500 + ((triglvl - 10) * 100);
    }
    if ((regValue & PMC_BOD1_LVLSEL_MASK) == 0)
    {
        voltage += ((hyst + 1) * 25);
    }

    return voltage;
}
extern void TestAdjustedLevelRegisterSetting(void)
{
    uint32_t level;
    uint32_t adjusted_level;

    for(uint32_t triglvl = 2; triglvl < 0x19; triglvl++)
    {
        for(uint32_t hyst = 0; hyst < 5; (triglvl < 10 ? hyst += 4 : hyst++))
        {
            if (hyst == 4)
            {
                level = triglvl | 0x100U;
            }
            else
            {
                level = triglvl | (hyst << 5);
            }
            for(int8_t offset = -4; offset < 5; offset++)
            {
                if (offset == -4)
                {
                    adjusted_level = AdjustedLevelRegisterSetting((bod_level_t)level, 0x1C);
                }
                if (offset == -3)
                {
                    adjusted_level = AdjustedLevelRegisterSetting((bod_level_t)level, 0x1D);
                }
                if (offset == -2)
                {
                    adjusted_level = AdjustedLevelRegisterSetting((bod_level_t)level, 0x1E);
                }
                if (offset == -1)
                {
                    adjusted_level = AdjustedLevelRegisterSetting((bod_level_t)level, 0x1F);
                }
                if (offset >= 0)
                {
                    adjusted_level = AdjustedLevelRegisterSetting((bod_level_t)level, (uint8_t)offset);
                }
                if (offset < 0)
                {
                    PRINTF("level = 0x%x, offset = -%d, adjusted_level = 0x%x\n", level, -offset, adjusted_level);
                    PRINTF("%d mV changed to %d mV, to compensate offset = -%d\n", BodRegisterToMilliVolt(level), BodRegisterToMilliVolt(adjusted_level), -offset);
                }
                else
                {
                    PRINTF("level = 0x%x, offset = %d, adjusted_level = 0x%x\n", level, offset, adjusted_level);
                    PRINTF("%d mV changed to %d mV, to compensate offset = %d\n", BodRegisterToMilliVolt(level), BodRegisterToMilliVolt(adjusted_level), offset);
                }
                if (BodRegisterToMilliVolt(adjusted_level) + (offset * 25) != BodRegisterToMilliVolt(level))
                {
                    PRINTF("ERROR\n");
                }
                SysTick_DelayTicks(10);
            }
        }
    }
}
#endif

/**
 * Measure the voltage on Vbat_hv using the given BOD instance.
 *
 * Normal operation of the selected BOD is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param instance 0 for BOD1 and 1 for BOD2.
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
static status_t MeasureVoltage(uint32_t instance, uint32_t *voltage)
{
    static const uint16_t levelSettings[] = {
        kBOD_LEVEL_1100mv, kBOD_LEVEL_1125mv, kBOD_LEVEL_1150mv, kBOD_LEVEL_1175mv, kBOD_LEVEL_1200mv,
        kBOD_LEVEL_1225mv, kBOD_LEVEL_1250mv, kBOD_LEVEL_1275mv, kBOD_LEVEL_1300mv, kBOD_LEVEL_1325mv,
        kBOD_LEVEL_1350mv, kBOD_LEVEL_1375mv, kBOD_LEVEL_1400mv, kBOD_LEVEL_1425mv, kBOD_LEVEL_1450mv,
        kBOD_LEVEL_1475mv, kBOD_LEVEL_1500mv, kBOD_LEVEL_1525mv, kBOD_LEVEL_1550mv, kBOD_LEVEL_1575mv,
        kBOD_LEVEL_1600mv, kBOD_LEVEL_1625mv, kBOD_LEVEL_1650mv, kBOD_LEVEL_1675mv, kBOD_LEVEL_1700mv,
        kBOD_LEVEL_1725mv, kBOD_LEVEL_1750mv, kBOD_LEVEL_1775mv, kBOD_LEVEL_1800mv, kBOD_LEVEL_1825mv,
        kBOD_LEVEL_1850mv, kBOD_LEVEL_1875mv, kBOD_LEVEL_1900mv, kBOD_LEVEL_1925mv, kBOD_LEVEL_1950mv,
        kBOD_LEVEL_1975mv, kBOD_LEVEL_2000mv, kBOD_LEVEL_2025mv, kBOD_LEVEL_2050mv, kBOD_LEVEL_2075mv,
        kBOD_LEVEL_2100mv, kBOD_LEVEL_2125mv, kBOD_LEVEL_2150mv, kBOD_LEVEL_2175mv, kBOD_LEVEL_2200mv,
        kBOD_LEVEL_2225mv, kBOD_LEVEL_2250mv, kBOD_LEVEL_2275mv, kBOD_LEVEL_2300mv, kBOD_LEVEL_2325mv,
        kBOD_LEVEL_2350mv, kBOD_LEVEL_2375mv, kBOD_LEVEL_2400mv, kBOD_LEVEL_2425mv, kBOD_LEVEL_2450mv,
        kBOD_LEVEL_2475mv, kBOD_LEVEL_2500mv, kBOD_LEVEL_2525mv, kBOD_LEVEL_2550mv, kBOD_LEVEL_2575mv,
        kBOD_LEVEL_2600mv, kBOD_LEVEL_2625mv, kBOD_LEVEL_2650mv, kBOD_LEVEL_2675mv, kBOD_LEVEL_2700mv,
        kBOD_LEVEL_2725mv, kBOD_LEVEL_2750mv, kBOD_LEVEL_2775mv, kBOD_LEVEL_2800mv, kBOD_LEVEL_2825mv,
        kBOD_LEVEL_2850mv, kBOD_LEVEL_2875mv, kBOD_LEVEL_2900mv, kBOD_LEVEL_2925mv, kBOD_LEVEL_2950mv,
        kBOD_LEVEL_2975mv, kBOD_LEVEL_3000mv, kBOD_LEVEL_3025mv, kBOD_LEVEL_3050mv, kBOD_LEVEL_3075mv,
        kBOD_LEVEL_3100mv};
    uint32_t intMask =
        instance == 0 ? ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_ENABLE_MASK : ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_ENABLE_MASK;
    uint32_t resetMask               = instance == 0 ?
                                           PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK :
                                           PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK | PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK;
    uint32_t nvicBodIrq              = instance == 0 ? BOD1_IRQn : BOD2_IRQn;
    void (*setBodLevel)(bod_level_t) = instance == 0 ? POWER_SetBod1Level : POWER_SetBod2Level;
    bool (*isBodActive)(void)        = instance == 0 ? POWER_IsBOD1Active : POWER_IsBOD2Active;
    uint32_t regValue;
    int32_t direction;
    uint32_t bodActive;
    uint32_t previousBodActive;
    /* Store previous measurement as a static variable. Always start from previous measurement */
    static uint32_t currentSetting = ARRAY_SIZE(levelSettings) - 1;

    if (instance > 1)
    {
        return kStatus_InvalidArgument;
    }

