zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    /* Store interrupt settings */
    uint32_t storedIntVal = ANACTRL->BOD_DCDC_INT_CTRL & intMask;
    /* Store NVIC interrupt setting */
    uint32_t storedNvicBodIrq = NVIC_GetEnableIRQ(nvicBodIrq);
    /* Store NVIC SYS interrupt setting */
    uint32_t storedNvicSysIrq = NVIC_GetEnableIRQ(WDT_BOD_IRQn);
    /* Store reset settings */
    uint32_t storedResetVal = PMC->RESETCTRL & resetMask;

    /* Disable NVIC interrupt */
    NVIC_DisableIRQ(nvicBodIrq);
    NVIC_DisableIRQ(WDT_BOD_IRQn);

    /* Enable interrupts */
    (instance == 0 ? EnableBOD1Interrupts : EnableBOD2Interrupts)();

    /* Disable reset */
    (instance == 0 ? DisableBOD1Resets : DisableBOD2Resets)();

    /* Start from previous measurement */
    setBodLevel(levelSettings[currentSetting]);
    POWER_delay_us(STABILIZATION_TIME_IN_US);

    /* The actual voltage is determined by changing the BOD trigger level until the level crosses Vbat_hv.
     * Determine direction of change from bodActive: if Vbat_hv is higher than trigger level,
     * the trigger level is increased each iteration until it is no longer below Vbat and vice versa.*/
    bodActive = previousBodActive = isBodActive();
    direction                     = bodActive ? -1 : 1;

    /* Change level until bodActive status changes or until end of range (based on direction) */
    while ((bodActive == previousBodActive) && ((currentSetting < ARRAY_SIZE(levelSettings) - 1) || direction < 0) &&
           ((currentSetting > 0) || direction > 0))
    {
        /* Update trigger level */
        currentSetting += direction;
        setBodLevel(levelSettings[currentSetting]);
        POWER_delay_us(STABILIZATION_TIME_IN_US);
        previousBodActive = bodActive;
        bodActive         = isBodActive();
    }

    /* Is Vbat_hv higher? */
    if (!bodActive && currentSetting < ARRAY_SIZE(levelSettings) - 1)
    {
        /* Yes, this means that trigger level is one step below actual voltage level. Adjust level. */
        currentSetting++;
    }

    /* Convert setting into voltage */
    *voltage = 1100 + currentSetting * 25;

    /* Restore reset settings */
    regValue = PMC->RESETCTRL;
    regValue = (regValue & ~resetMask) | storedResetVal;
    /* Restore interrupt settings */
    ANACTRL->BOD_DCDC_INT_CTRL |= storedIntVal;
    /* Restore NVIC interrupt setting */
    (storedNvicBodIrq ? NVIC_EnableIRQ : NVIC_DisableIRQ)(nvicBodIrq);
    /* Restore NVIC SYS interrupt setting */
    (storedNvicSysIrq ? NVIC_EnableIRQ : NVIC_DisableIRQ)(WDT_BOD_IRQn);

    return kStatus_Success;
}

/*******************************************************************************
 * Public functions
 ******************************************************************************/

/**
 * brief    Shut off the Flash and execute the _WFI(), then power up the Flash after wake-up event.
 *     		Shut off the Flash is done by hardware, then power up the Flash after wake-up event also.
 * 			Flush flash cache is only relevant when doing flash accesses like write or erase, not for executing from flash.
 * 			It is the responsibility of the user to properly finalize these functions before calling PMC driver lower power
 * API. param    None return    Nothing
 */
void CHIPLOWPOWER_PowerCycleCpuAndFlash(void)
{
    /* artf1040389 BOD workaround */
    /* store PDEN_BOD1/2 from PDRUNCFG register into AOREG1 for non retention modes */
    uint32_t pdruncfg0 = PMC->PDRUNCFG0;
    uint32_t pden_bod1 = (pdruncfg0 & PMC_PDRUNCFG0_PDEN_BOD1_MASK) >> PMC_PDRUNCFG0_PDEN_BOD1_SHIFT;
    uint32_t pden_bod2 = (pdruncfg0 & PMC_PDRUNCFG0_PDEN_BOD2_MASK) >> PMC_PDRUNCFG0_PDEN_BOD2_SHIFT;
    PMC->AOREG1 &= ~(kAOREG1_BOD1_MASK | kAOREG1_BOD2_MASK);
    PMC->AOREG1 |= ((pden_bod1 << kAOREG1_BOD1_SHIFT) | (pden_bod2 << kAOREG1_BOD2_SHIFT));
    /* write values of PDEN_BOD1/2 bits from PDSLEEPCFG register to PDRUNCFG register. */
    uint32_t pdruncfg0_wo = pdruncfg0 & ~(PMC_PDRUNCFG0_PDEN_BOD1_MASK | PMC_PDRUNCFG0_PDEN_BOD2_MASK);
    /* makes use of identical bit positions in RUN and SLEEP register - this will never change */
    pdruncfg0_wo |= (PMC->PDSLEEPCFG0 & (PMC_PDSLEEPCFG0_PDEN_BOD1_MASK | PMC_PDSLEEPCFG0_PDEN_BOD2_MASK));
    PMC->PDRUNCFG0 = pdruncfg0_wo;

    /* Configure the Cortex-M33 in Deep Sleep mode */
    SCB->SCR = SCB->SCR | SCB_SCR_SLEEPDEEP_Msk;

    /* Enter in low power mode */
    __WFI();

    /* Configure the Cortex-M33 in Active mode */
    SCB->SCR = SCB->SCR & (~SCB_SCR_SLEEPDEEP_Msk);

    /* this is retention mode, restore the PDEN_BOD1 and PDEN_BOD2 values of the PMC_PDRUNCFG0 register */
    PMC->PDRUNCFG0 = pdruncfg0;
}

void POWER_Reset(void)
{
    PMC->RESETCTRL |= PMC_RESETCTRL_SWRRESETENABLE_MASK;
    SYSCON->SWR_RESET = 0x5A000001;

    while (1)
    {
        ;
    }
}

void POWER_Init(void)
{
/* Example code to toggle pins and add debug prints from power driver */
#if 0
  PRINTF("Hello, I am the power driver.\n");

  /* Init pin 16*/
  gpio_pin_config_t pin_config = {
  .pinDirection = kGPIO_DigitalOutput,
  .outputLogic = 0U
  };
  GPIO_PinInit(GPIO, 0, 16, &pin_config);

  /* Set pin 16 low */
  GPIO_PortClear(GPIO, 0, 1U << 16);

  /* Set pin 16 high*/
  GPIO_PortSet(GPIO, 0, 1U << 16);
#endif
    /* DISCLAIMER: THIS IS EXPERIMENTAL CODE. REMOVE IF THIS CAUSES PROBLEMS (HCIOT-2181). */
    /* Write a 1b to the PMC_DCDC0_ENABLE_BYPASS bit followed by writing a zero.
       After these two actions, it is guaranteed that the LPBS switch is open. */
    PMC->DCDC0 |= PMC_DCDC0_ENABLE_BYPASS_MASK;
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;

    /* Allow dcdc startup for Vbat < 2v5 e.g. when coming out of deepsleep/powerdown */
    PMC->DCDC0 |= PMC_DCDC0_ROBUST_STARTUP_DISABLE_MASK;

    /* Increase startup time of 32 MHz XTAL from HW default 160us to 288us (9*32us).
    According to datasheet typical value is 209us and max value 270us.   */
    POWER_XTAL32M_SetStartupTime(9);

    /*  There are different techniques to reduce SRAM current in low power modes.
     *  Amongst them are voltage Scaling and source biasing.
     *  But they can not be combined, it is either voltage scaling or source biasing.
     *  Validation must indicate which technique is the most optimal for DEEPSLEEP/POWERDOWN.
     *  if something is planned as part of validation For now voltage scaling is used in all Low Power modes,
     *  just like in Niobe4Mini. So source biasing must be disabled.
     */
    PMC->SRAMCTRL = (PMC->SRAMCTRL & (~PMC_SRAMCTRL_SMB_MASK)) | PMC_SRAMCTRL_SMB(3);

