zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    /*
     * R/W assist is a technique to improve R/W at lower voltage and over lifetime of the SRAM.
     * Default values indicated by memory team must be used and are not supposed to change.
     * In case they do, firmware must write these POR hardware defaults.
     */
    //   SRAMASSISTCTRL0 = 0xCB2CB2;
    //   SRAMASSISTCTRL1 = 0x2A;

    // enable auto clock gating of SRAMS - to be able to switch SRAM power mode - see artf861757 - and all the rest also
    // at the same time
    SYSCON->AUTOCLKGATEOVERRIDE =
        (SYSCON->AUTOCLKGATEOVERRIDE &
         ~(SYSCON_AUTOCLKGATEOVERRIDE_ROM_MASK | SYSCON_AUTOCLKGATEOVERRIDE_RAMX_CTRL_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_RAM0_CTRL_MASK | SYSCON_AUTOCLKGATEOVERRIDE_RAM1_CTRL_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_RAM2_CTRL_MASK | SYSCON_AUTOCLKGATEOVERRIDE_SYNC0_APB_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_SYNC1_APB_MASK | SYSCON_AUTOCLKGATEOVERRIDE_FLASH_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_FMC_MASK | SYSCON_AUTOCLKGATEOVERRIDE_CRCGEN_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_SDMA0_MASK | SYSCON_AUTOCLKGATEOVERRIDE_SDMA1_MASK |
           SYSCON_AUTOCLKGATEOVERRIDE_SYSCON_MASK)) |
        (0xC0DE << SYSCON_AUTOCLKGATEOVERRIDE_ENABLEUPDATE_SHIFT);
    // Note: there is no SYSCON_AUTOCLKGATEOVERRIDE for BLE RAM

    // goto DEEPSLEEP (retention) mode in PMC Low-power modes DSLP and PWDN except when already in SHUTDOWN, then remain
    // in SHUTDOWN
    PMC->SRAMRETCTRL = PMC_SRAMRETCTRL_RETEN_RAMX0_MASK | PMC_SRAMRETCTRL_RETEN_RAMX1_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAMX2_MASK | PMC_SRAMRETCTRL_RETEN_RAMX3_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAM00_MASK | PMC_SRAMRETCTRL_RETEN_RAM10_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAM20_MASK | PMC_SRAMRETCTRL_RETEN_RAMBLEDATA_MASK |
                       PMC_SRAMRETCTRL_RETEN_RAMBLESEQL_MASK;

    uint32_t pmc_ldomem = PMC->LDOMEM;
    /* Do not keep 1V from ACTIVE state but change to 0.6x V in low power mode  */
    pmc_ldomem |= PMC_LDOMEM_VADJ_PWD_MASK;
    /* Set 1 V for lowest power consumption */
    pmc_ldomem &= ~PMC_LDOMEM_VADJ_MASK;
    pmc_ldomem |= (kLDO_MEM_1000mv << PMC_LDOMEM_VADJ_SHIFT);
    PMC->LDOMEM = pmc_ldomem;

    uint32_t pmc_ldodig = PMC->LDODIG;
    /* Set 1 V for lowest power consumption */
    pmc_ldodig &= ~PMC_LDODIG_VADJ_MASK;
    pmc_ldodig |= (kLDO_DIG_1000mv << PMC_LDODIG_VADJ_SHIFT);
    PMC->LDODIG = pmc_ldodig;

    /* Enable LSActive for lowest power consumption */
    /* IMPORTANT: This bit must always be set to 1. Flash is characterized with this bit set. */
    FMU0->FCTRL |= FMU_FCTRL_LSACTIVE_MASK;

    /* artf1040389 BOD workaround */
    /* restore PDEN_BOD1/2 from AOREG1 to PDRUNCFG register for non retention modes */
    uint32_t pden_bod1 = (PMC->AOREG1 & kAOREG1_BOD1_MASK) >> kAOREG1_BOD1_SHIFT;
    uint32_t pden_bod2 = (PMC->AOREG1 & kAOREG1_BOD2_MASK) >> kAOREG1_BOD2_SHIFT;
    uint32_t pdruncfg0 = PMC->PDRUNCFG0;
    pdruncfg0 &= ~(PMC_PDRUNCFG0_PDEN_BOD1_MASK | PMC_PDRUNCFG0_PDEN_BOD2_MASK);
    pdruncfg0 |= ((pden_bod1 << PMC_PDRUNCFG0_PDEN_BOD1_SHIFT) | (pden_bod2 << PMC_PDRUNCFG0_PDEN_BOD2_SHIFT));
    PMC->PDRUNCFG0 = pdruncfg0;

    /* restore PMC settings in XR_SM modes */
    uint32_t aoreg1 = PMC->AOREG1;
    /* clear XR_SM mode in AOREG1 to be able to recover next time in case supply is not connected anymore and there is a
     * hang further down */
    /* POWER_DCDC_SetSupplyMode() will set it back. */
    PMC->AOREG1 &= ~(kAOREG1_DCDC_MODE_XR_SM_SS_MASK | kAOREG1_DCDC_MODE_XR_SM_DS_MASK);

    if (aoreg1 & kAOREG1_DCDC_MODE_XR_SM_SS_MASK)
    {
        POWER_DCDC_SetSupplyMode(kDCDC_MODE_XR_SM_SS);
    }
    else if (aoreg1 & kAOREG1_DCDC_MODE_XR_SM_DS_MASK)
    {
        POWER_DCDC_SetSupplyMode(kDCDC_MODE_XR_SM_DS);
    }

    /* Clean-up boot-loader leftovers that consume power */
    /* Disable all unused clocks that are on by default after boot */
    CLOCK_DisableClock(kCLOCK_Rng);

    /*    CLOCK_DisableClock(kCLOCK_Rom);*/ /* required for debugging */
    CLOCK_DisableClock(kCLOCK_Iocon);
    CLOCK_DisableClock(kCLOCK_Gpio0);
    CLOCK_DisableClock(kCLOCK_Sysctl);
    CLOCK_DisableClock(kCLOCK_HashCrypt);
    CLOCK_DisableClock(kCLOCK_Puf);
    CLOCK_DisableClock(kCLOCK_Casper);
    /*    CLOCK_DisableClock(kCLOCK_AnalogCtrl);*/ /* required for debugging */
}

/*!
 * @brief Function to disable the power of an analog peripheral when the device is in active mode.
 * @param power_config_bit    peripheral for which to disable the power
 */
void POWER_PeripheralPowerOff(power_config_bit_t power_config_bit)
{
    PMC->PDRUNCFGSET0 = power_config_bit;
}

/*!
 * @brief Function to set the delay for the XTAL oscillator to start up.
 * @param delay    delay time in ms
 */
void POWER_XTAL32K_SetStartupTime(uint32_t startupTime)
{
    POWER_XTALStartupTime = startupTime;
}

/*!
 * @brief Function to enable the power of an analog peripheral when the device is in active mode.
 * @param power_config_bit    peripheral for which to enable the power
 */
void POWER_PeripheralPowerOn(power_config_bit_t power_config_bit)
{
    if (power_config_bit & kPOWERCFG_XTAL32K)
    {
        if (PMC->PDRUNCFG0 & kPOWERCFG_XTAL32K) /* Check 32K XTAL not on yet (1 means off in PDRUNCFG0)*/
        {
            PMC->PDRUNCFGCLR0 = power_config_bit;
            POWER_delay_ms(POWER_XTALStartupTime); /* Delay configurable with API, in case customer uses different XTAL
                                                      configuration. */
        }
    }
    if (power_config_bit & kPOWERCFG_FRO32K)
    {
        if (PMC->PDRUNCFG0 & kPOWERCFG_FRO32K) /* Check 32K FRO not on yet (1 means off in PDRUNCFG0)*/
        {
            PMC->PDRUNCFGCLR0 = power_config_bit;
            POWER_delay_ms(DEFAULT_FRO_STARTUP_DELAY); /* Delay NOT configurable with API, we assume FRO startup not to
                                                          vary too much. */
        }
    }
    else if (power_config_bit & kPOWERCFG_BLE) /* Check 32MHz XTAL not on yet (1 means off in PDRUNCFG0)*/
    {
        if (PMC->PDRUNCFG0 & kPOWERCFG_BLE)
        {
#define PMC_BLE_STATE                  ((PMC->STATUS & PMC_STATUS_FSMBLESTATE_MASK) >> PMC_STATUS_FSMBLESTATE_SHIFT)
#define PMC_BLE_STATE_RADIO_ACTIVE     (6u)
#define PMC_BLE_STATE_ENABLE_CLOCK_OUT (2u)

