zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
            PMC->PDRUNCFGCLR0 = power_config_bit;
            /* Wait until 32 MHz xtal osc is active*/
            while ((PMC_BLE_STATE != PMC_BLE_STATE_ENABLE_CLOCK_OUT) && (PMC_BLE_STATE != PMC_BLE_STATE_RADIO_ACTIVE))
            {
            }
        }
    }
    else
    {
        PMC->PDRUNCFGCLR0 = power_config_bit;
    }
}

#define PMC_SRAMCTRL0_RAMX0_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX0_LS_MASK | PMC_SRAMCTRL0_RAMX0_DSB_MASK | PMC_SRAMCTRL0_RAMX0_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX0_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAMX1_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX1_LS_MASK | PMC_SRAMCTRL0_RAMX1_DSB_MASK | PMC_SRAMCTRL0_RAMX1_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX1_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAMX2_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX2_LS_MASK | PMC_SRAMCTRL0_RAMX2_DSB_MASK | PMC_SRAMCTRL0_RAMX2_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX2_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAMX3_MASK                                                                    \
    (PMC_SRAMCTRL0_RAMX3_LS_MASK | PMC_SRAMCTRL0_RAMX3_DSB_MASK | PMC_SRAMCTRL0_RAMX3_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAMX3_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAM00_MASK                                                                    \
    (PMC_SRAMCTRL0_RAM00_LS_MASK | PMC_SRAMCTRL0_RAM00_DSB_MASK | PMC_SRAMCTRL0_RAM00_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAM00_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAM10_MASK                                                                    \
    (PMC_SRAMCTRL0_RAM10_LS_MASK | PMC_SRAMCTRL0_RAM10_DSB_MASK | PMC_SRAMCTRL0_RAM10_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAM10_LSDEL_MASK)
#define PMC_SRAMCTRL0_RAM20_MASK                                                                    \
    (PMC_SRAMCTRL0_RAM20_LS_MASK | PMC_SRAMCTRL0_RAM20_DSB_MASK | PMC_SRAMCTRL0_RAM20_DSBDEL_MASK | \
     PMC_SRAMCTRL0_RAM20_LSDEL_MASK)

#define PMC_SRAMCTRL1_RAMBLEDATA_MASK                                                                              \
    (PMC_SRAMCTRL1_RAMBLEDATA_LS_MASK | PMC_SRAMCTRL1_RAMBLEDATA_DSB_MASK | PMC_SRAMCTRL1_RAMBLEDATA_DSBDEL_MASK | \
     PMC_SRAMCTRL1_RAMBLEDATA_LSDEL_MASK)
#define PMC_SRAMCTRL1_RAMBLESEQL_MASK                                                                              \
    (PMC_SRAMCTRL1_RAMBLESEQL_LS_MASK | PMC_SRAMCTRL1_RAMBLESEQL_DSB_MASK | PMC_SRAMCTRL1_RAMBLESEQL_DSBDEL_MASK | \
     PMC_SRAMCTRL1_RAMBLESEQL_LSDEL_MASK)

#define PMC_SRAMCTRL0_NORMAL_MODE   (PMC_SRAMCTRL0_RAMX0_DSB_MASK | PMC_SRAMCTRL0_RAMX0_DSBDEL_MASK)
#define PMC_SRAMCTRL0_SHUTDOWN_MODE (PMC_SRAMCTRL0_RAMX0_LS_MASK | PMC_SRAMCTRL0_RAMX0_LSDEL_MASK)

/*!
 * @brief Function to power off certain SRAM segments.
 * @param sram_ctrl    mask of sram_ctrl_bit_t bits to power off.
 */
void POWER_DisableSRAM(uint32_t sram_ctrl)
{
    // SYSCON:AHBCLKCTRL0:SRAM_CTRL1/2 =   //see artf861757  - rely on auto gating for now.
    if (sram_ctrl & kSRAM_CTRL_RAMX0)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX0_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX0_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMX1)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX1_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX1_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMX2)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX2_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX2_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMX3)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX3_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX3_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAM00)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM00_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAM00_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAM10)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM10_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAM10_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAM20)
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM20_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAM20_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMBLEDATA)
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLEDATA_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl1 = PMC->SRAMCTRL1;
            pmc_sram_ctrl1 &= ~PMC_SRAMCTRL1_RAMBLEDATA_MASK;
            pmc_sram_ctrl1 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT);
            PMC->SRAMCTRL1 = pmc_sram_ctrl1;
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMBLESEQL)
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLESEQL_MASK) !=
            (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl1 = PMC->SRAMCTRL1;
            pmc_sram_ctrl1 &= ~PMC_SRAMCTRL1_RAMBLESEQL_MASK;
            pmc_sram_ctrl1 |= (PMC_SRAMCTRL0_SHUTDOWN_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT);
            PMC->SRAMCTRL1 = pmc_sram_ctrl1;
        }
    }
}

/*!
 * @brief Function to power on certain SRAM segments. By default all SRAM segments are on.
 * @param sram_ctrl    mask of sram_ctrl_bit_t bits to power on.
 */
void POWER_EnableSRAM(uint32_t sram_ctrl)
{
    // SYSCON:AHBCLKCTRL0:SRAM_CTRL1/2 =   //see artf861757  - rely on auto gating for now.
    if (sram_ctrl & kSRAM_CTRL_RAMX0) // ON
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX0_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX0_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
            POWER_delay_us(1); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMX1) // ON
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX1_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX1_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
            POWER_delay_us(1); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMX2) // ON
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX2_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX2_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
            POWER_delay_us(1); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMX3) // ON
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX3_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAMX3_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
            POWER_delay_us(1); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

