zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    if (sram_ctrl & kSRAM_CTRL_RAM00) // ON
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM00_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAM00_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
            POWER_delay_us(4); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAM10) // ON
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM10_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAM10_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
            POWER_delay_us(6); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAM20) // ON
    {
        if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM20_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl0 = PMC->SRAMCTRL0;
            pmc_sram_ctrl0 &= ~PMC_SRAMCTRL0_RAM20_MASK;
            pmc_sram_ctrl0 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT);
            PMC->SRAMCTRL0 = pmc_sram_ctrl0;
            POWER_delay_us(12); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMBLEDATA) // ON
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLEDATA_MASK) !=
            (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl1 = PMC->SRAMCTRL1;
            pmc_sram_ctrl1 &= ~PMC_SRAMCTRL1_RAMBLEDATA_MASK;
            pmc_sram_ctrl1 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT);
            PMC->SRAMCTRL1 = pmc_sram_ctrl1;
            POWER_delay_us(4); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }

    if (sram_ctrl & kSRAM_CTRL_RAMBLESEQL) // ON
    {
        if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLESEQL_MASK) !=
            (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT))
        {
            uint32_t pmc_sram_ctrl1 = PMC->SRAMCTRL1;
            pmc_sram_ctrl1 &= ~PMC_SRAMCTRL1_RAMBLESEQL_MASK;
            pmc_sram_ctrl1 |= (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT);
            PMC->SRAMCTRL1 = pmc_sram_ctrl1;
            POWER_delay_us(1); // wait till SRAM ready to be used (HCIOT-1947, artf953383)
        }
    }
}

/*!
 * @brief Function to return power status of all SRAM segments.
 * @return sram_ctrl_bit_t bits of enabled SRAM segments.
 */
uint32_t POWER_GetSRAMConfig(void)
{
    uint32_t sram_ctrl = 0;

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX0_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX0_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAMX0;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX1_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX1_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAMX1;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX2_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX2_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAMX2;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAMX3_MASK) != (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAMX3_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAMX3;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM00_MASK) == (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM00_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAM00;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM10_MASK) == (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM10_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAM10;
    }

    if ((PMC->SRAMCTRL0 & PMC_SRAMCTRL0_RAM20_MASK) == (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL0_RAM20_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAM20;
    }

    if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLEDATA_MASK) ==
        (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLEDATA_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAMBLEDATA;
    }

    if ((PMC->SRAMCTRL1 & PMC_SRAMCTRL1_RAMBLESEQL_MASK) ==
        (PMC_SRAMCTRL0_NORMAL_MODE << PMC_SRAMCTRL1_RAMBLESEQL_LS_SHIFT))
    {
        sram_ctrl |= kSRAM_CTRL_RAMBLESEQL;
    }
    return sram_ctrl;
}

/**
 * PMC Sleep function call: stop CPU, continues execution after wakeup
 */
void POWER_EnterSleep(void)
{
    uint32_t pmsk;
    pmsk = DisableGlobalIRQ();

    SCB->SCR &= ~SCB_SCR_SLEEPDEEP_Msk;
    __WFI();

    EnableGlobalIRQ(pmsk);
}

/**
 * PMC Deep Sleep function call: stop CPU and power down flash, continues execution after wakeup
 */
status_t POWER_EnterDeepSleep(uint32_t exclude_from_pd, uint64_t wakeup_interrupts)
{
    uint32_t cpu0_nmi_enable;
    uint32_t cpu0_int_enable_0;
    uint32_t cpu0_int_enable_1;

    // check validity of inputs ...................................
    // 1. only the following peripherals can be excluded from power down:   kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPSLEEP
    if (exclude_from_pd & ~kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPSLEEP)
    {
        return kStatus_InvalidArgument;
    }
    // 2. some analog peripherals need to stay powered.  => assumed all done by hardware.
    // 3. some combinations are not allowed
    // 3.2 kLOWPOWERCFG_BLE_WUP may only be set when either kLOWPOWERCFG_FRO32K or kLOWPOWERCFG_XTAL32K is set.
    // (remember the dirty exception of RTC and OSTIMER)
    if (exclude_from_pd & kLOWPOWERCFG_BLE_WUP)
    {
        if (!(exclude_from_pd & (kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K)))
        {
            return kStatus_InvalidArgument;
        }
    }
    // 3.3 FRO192M may only be set when HFDSM is set
    if (exclude_from_pd & kLOWPOWERCFG_FRO192M)
    {
        if (!(exclude_from_pd & kLOWPOWERCFG_HFDSM))
        {
            return kStatus_InvalidArgument;
        }
    }

    // 4. combinations with other registers:

