zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    // 4.1 BOD resets: when enabled, BOD should stay powered
    uint32_t pmc_reset_ctrl = PMC->RESETCTRL;
    if (((pmc_reset_ctrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT) ||
        ((pmc_reset_ctrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT))
    {
        if (!(exclude_from_pd & kLOWPOWERCFG_BOD1))
        {
            return kStatus_InvalidArgument;
        }
    }
    if (((pmc_reset_ctrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT) ||
        ((pmc_reset_ctrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT))
    {
        if (!(exclude_from_pd & kLOWPOWERCFG_BOD2))
        {
            return kStatus_InvalidArgument;
        }
    }

    // artf834542: No CTIMER and UTICK at 1MHz during DEEPSLEEP with LDO_DIG = 0.6x V.
    if (!(exclude_from_pd & kLOWPOWERCFG_HFDSM)) // not 1V mode
    {
        if (exclude_from_pd & kLOWPOWERCFG_FRO1M) // FRO1M enables
        {
            if (SYSCON->AHBCLKCTRL.AHBCLKCTRL1 & SYSCON_AHBCLKCTRL1_UTICK_MASK) // UTICK is always connected to FRO1M
            {
                return kStatus_InvalidArgument;
            }
            // CTIMER can be connected directly to FRO1M, or via main clock
            // direct to FRO1M
            if (((SYSCON->CTIMERCLKSELX[0] & SYSCON_CTIMERCLKSEL0_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[1] & SYSCON_CTIMERCLKSEL1_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[2] & SYSCON_CTIMERCLKSEL2_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[3] & SYSCON_CTIMERCLKSEL3_SEL_MASK) == 4) |
                ((SYSCON->CTIMERCLKSELX[4] & SYSCON_CTIMERCLKSEL4_SEL_MASK) == 4))
            {
                return kStatus_InvalidArgument;
            }
            // via main clock
            // first check if main clock is connected to FRO1M
            if (((SYSCON->MAINCLKSELA & SYSCON_MAINCLKSELA_SEL_MASK) == 2) &&
                ((SYSCON->MAINCLKSELB & SYSCON_MAINCLKSELB_SEL_MASK) == 0))
            {
                // then check CTIMERS
                if (((SYSCON->CTIMERCLKSELX[0] & SYSCON_CTIMERCLKSEL0_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[1] & SYSCON_CTIMERCLKSEL1_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[2] & SYSCON_CTIMERCLKSEL2_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[3] & SYSCON_CTIMERCLKSEL3_SEL_MASK) == 0) |
                    ((SYSCON->CTIMERCLKSELX[4] & SYSCON_CTIMERCLKSEL4_SEL_MASK) == 0))
                {
                    return kStatus_InvalidArgument;
                }
            }
        }
    }

    // end check valid combinations ...................................

    status_t status = POWER_SetPowerConfiguration(kLP_MODE_DEEPSLEEP, &exclude_from_pd);
    if (status != kStatus_Success)
    {
        return status;
    }

    // mask all sleepcfg0 register bits
    uint32_t pmc_sleepcfg0 = ~(exclude_from_pd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    pmc_sleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_CORE_MASK;                                        // keep core enabled
    pmc_sleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_LDOMEM_MASK | PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK); // keep ldo's enabled

    // check High Frequency Deep Sleep Mode - set LDO DIG voltage
    uint32_t pmc_ldodig = PMC->LDODIG;
    pmc_ldodig &= ~PMC_LDODIG_VADJ_PWD_MASK;
    pmc_sleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_BIAS_MASK; // clear bias bits
    if (exclude_from_pd & kLOWPOWERCFG_HFDSM)
    {
        pmc_sleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63; // bias must stay on in 1V mode
        pmc_sleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK);
    }
    else
    {
        pmc_ldodig |= PMC_LDODIG_VADJ_PWD_MASK;
        pmc_sleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63; // bias must be set to 0.63 in DeepSleep as much of the digital
                                                         // (CORE power domain) stays on
    }
    PMC->LDODIG = pmc_ldodig;

    // check BLE WakeUP
    if (exclude_from_pd & kLOWPOWERCFG_BLE_WUP)
    {
        // keep all required peripherals on for this mode - assume XO32M always off during deep sleep for now
        pmc_sleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_BLE_MASK);
    }

    /* Lower System Clock to FRO12Mhz if necessary */
    uint32_t restore_clock_settings = 0;
    uint32_t FLASHReadWaitStates;
    uint32_t core_sys_clk_configuration;
    /* See Clock structure diagram in Hardware Architecture Specification */
    if (((SYSCON->MAINCLKSELA == MAINCLKSELA_FRO_12MHz) && (SYSCON->MAINCLKSELB == MAINCLKSELB_MAINCLKAOUT)) ||
        ((SYSCON->MAINCLKSELA == MAINCLKSELA_FRO_1MHz) && (SYSCON->MAINCLKSELB == MAINCLKSELB_MAINCLKAOUT)) ||
        (SYSCON->MAINCLKSELB == MAINCLKSELB_32K_OSC) || (SYSCON->MAINCLKSELB == MAINCLKSELB_32K_OSC_ALTERNATE_VALUE1))
    {
    }
    else
    {
        /* Switch System Clock to FRO12Mhz (the configuration before calling this function will be restored back) */
        FLASHReadWaitStates        = CLOCK_GetFLASHAccessCycles();
        core_sys_clk_configuration = CLOCK_GetCoreSysClkConfiguration();
        CLOCK_SetupFROClocking(kFreq_12MHz); // do we need a check here in case clock is lower than 12MHz?
        CLOCK_SetFLASHAccessCyclesForFreq(
            kFreq_12MHz); // only relevant when running from flash - is it worth the effort to switch this?
        restore_clock_settings = 1;
    }

    // set excluded peripherals
    PMC->PDSLEEPCFG0 = pmc_sleepcfg0;

    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_DEEPSLEEP << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    cpu0_nmi_enable = SYSCON->NMISRC & SYSCON_NMISRC_NMIENCPU0_MASK; /* Save the configuration of the NMI Register */
    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK;                 /* Disable NMI of CPU0 */

