zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    /*
     * Enable wake up interrupt.
     * Rational : we enable each interrupt (NVIC->ISER) that can wake up the CPU here (before the __disable_irq()
     * below): Hence, if an interrupt was pending and not treated before (for any reason), the CPU will jump to that
     *            interrupt handler before trying to enter the low power mode.
     *            VERY IMPORTANT : Also, any interrupt set in NVIC->ISER, even though __disable_irq(), will make the CPU
     *                             go out of the Deep Sleep mode.
     */

    /* But first save the configuration of the CPU interrupt set enable Registers */
    cpu0_int_enable_0 = NVIC->ISER[0];
    cpu0_int_enable_1 = NVIC->ISER[1];

    NVIC->ISER[0] = (uint32_t)(wakeup_interrupts & 0xFFFFFFFF);
    NVIC->ISER[1] = (uint32_t)((wakeup_interrupts >> 32) & 0xFFFFFFFF);

    /* Enable wake-up sources */
    SYSCON->STARTER[0] = (uint32_t)(wakeup_interrupts & 0xFFFFFFFF);
    SYSCON->STARTER[1] = (uint32_t)((wakeup_interrupts >> 32) & 0xFFFFFFFF);

    uint32_t g_savedPrimask = 0;

    /* Make sure DEEP POWER DOWN reset is disabled else DeepSleep will reset iso. continue */
    PMC->RESETCTRL &= (~PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK);

    /* Disable all IRQs */
    g_savedPrimask = DisableGlobalIRQ();

    // wait for random number generator to be finished.
    // Would it trigger a false wake-up when still running ?
    // => no it does not
    // => after reading out random generator it takes about 2ms to generate a new value.
    // => this process is paused while sleeping and continues after wakeup - all automatically
    // => so no error bits are set (anymore) when coming out of deep sleep, see comment in line 1822 in fsl_trng.c
    // function TRNG_GetRandomData
    //	While (TRNG->MCTL & TRNG_MCTL_TSTOP_OK_MASK == 0);  => so this is not needed

    /* Disable the Flash, execute _WFI() instruction then enable the Flash after wake up event */
    CHIPLOWPOWER_PowerCycleCpuAndFlash();

    if (restore_clock_settings == 1)
    {
        // restore main clock settings
        // restore flash wait cycles
        CLOCK_SetFLASHAccessCycles(
            FLASHReadWaitStates); // do we need a check here in case restored clock is lower than 12MHz?
        // restore System Clock
        CLOCK_SetCoreSysClkConfiguration(core_sys_clk_configuration);
    }

    /* Enable all interrupts */
    EnableGlobalIRQ(g_savedPrimask);

    /* Restore ACTIVE mode to allow using normal WFI again */
    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_ACTIVE << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    /* Reset Sleep Postpone configuration */
    //	SYSCON->HARDWARESLEEP = 0;  todo

    /* Restore the configuration of the NMI Register */
    SYSCON->NMISRC |= cpu0_nmi_enable;

    /* Restore the configuration of the CPU interrupt enable Registers */
    NVIC->ISER[0] = cpu0_int_enable_0;
    NVIC->ISER[1] = cpu0_int_enable_1;

    return kStatus_Success;
}

/**
 * PMC Power Down function call: power down flash and CPU, reset @ wakeup interrupt
 */
status_t POWER_EnterPowerDown(uint32_t exclude_from_pd, uint64_t wakeup_interrupts, uint32_t cpu_retention_ctrl)
{
    uint32_t cpu0_nmi_enable;
    uint32_t cpu0_int_enable_0;
    uint32_t cpu0_int_enable_1;
    uint32_t anactrl_bod_dcdc_int_ctrl;
    //    uint32_t rng_entropy_save[6];
    //    uint32_t analog_ctrl_regs[12]; /* To store Analog Controller Registers */

    // check validity of inputs ...................................
    // 1. only the following peripherals can be excluded from power down:
    if (exclude_from_pd & ~kEXCLUDE_FROM_PD_LIMITATION_MASK_POWERDOWN)
    {
        return kStatus_InvalidArgument;
    }
    // 2. some analog peripherals need to stay powered.
    // 3. some combinations are not allowed
    // 3.2 kLOWPOWERCFG_BLE_WUP may only be set when either kLOWPOWERCFG_FRO32K or kLOWPOWERCFG_XTAL32K is set.
    // (remember the dirty exception of RTC and OSTIMER)
    if (exclude_from_pd & kLOWPOWERCFG_BLE_WUP)
    {
        if (!(exclude_from_pd & (kLOWPOWERCFG_FRO32K | kLOWPOWERCFG_XTAL32K)))
        {
            return kStatus_InvalidArgument;
        }
    }

    // 4. combinations with other registers:

    // 4.1 BOD resets: when enabled, BOD should stay powered
    uint32_t pmc_reset_ctrl = PMC->RESETCTRL;
    if (((pmc_reset_ctrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT) ||
        ((pmc_reset_ctrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT))
    {
        if (!(exclude_from_pd & kLOWPOWERCFG_BOD1))
        {
            return kStatus_InvalidArgument;
        }
    }
    if (((pmc_reset_ctrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT) ||
        ((pmc_reset_ctrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT))
    {
        if (!(exclude_from_pd & kLOWPOWERCFG_BOD2))
        {
            return kStatus_InvalidArgument;
        }
    }

    // What about wakeup interrupts.  Allowed in PowerDown are: kWAKEUP_GINT0, kWAKEUP_FLEXCOMM0, kWAKEUP_BLE_SLP_TMR,
    // kWAKEUP_RTC, kWAKEUP_OS_EVENT, wakeup pin as gpio
    if (wakeup_interrupts & ~(kWAKEUP_GINT0 | kWAKEUP_FLEXCOMM0 | kWAKEUP_BLE_SLP_TMR | kWAKEUP_RTC |
                              kWAKEUP_OS_EVENT /* | wakeup pin as gpio */))
    {
        return kStatus_InvalidArgument;
    }

    // end check valid combinations ...................................

    status_t status = POWER_SetPowerConfiguration(kLP_MODE_POWERDOWN, &exclude_from_pd);
    if (status != kStatus_Success)
    {
        return status;
    }

    uint32_t pmc_sleepcfg0 = ~(exclude_from_pd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    // bias must be set to 0.66 V in power down, but BOD requires 0.63 V
    pmc_sleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_BIAS_MASK; // clear bias bits
    if (exclude_from_pd & (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2))
    {
        pmc_sleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63;
    }
    else
    {
        pmc_sleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_66;
    }

    PMC->LDODIG |= PMC_LDODIG_VADJ_PWD_MASK;

    pmc_sleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_LDOMEM_MASK;
    pmc_sleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_LDODIG_MASK;

    // check BLE WakeUP
    if (exclude_from_pd & kLOWPOWERCFG_BLE_WUP)
    {
        // keep all required peripherals on for this mode
        pmc_sleepcfg0 &= ~(PMC_PDSLEEPCFG0_PDEN_BLE_MASK);
    }

