zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    // cpu retention control
    SYSCON->FUNCRETENTIONCTRL &=
        (~(SYSCON_FUNCRETENTIONCTRL_FUNCRETENA_MASK | SYSCON_FUNCRETENTIONCTRL_RET_START_MASK));
    if (cpu_retention_ctrl)
    {
        SYSCON->FUNCRETENTIONCTRL |=
            (SYSCON_FUNCRETENTIONCTRL_FUNCRETENA_MASK |
             (((CPU_RETENTION_RAMX_STORAGE_START_ADDR >> 2) << SYSCON_FUNCRETENTIONCTRL_RET_START_SHIFT) &
              SYSCON_FUNCRETENTIONCTRL_RET_START_MASK));
        POWER_SavePinRegisters();
    }
    /* Switch System Clock to FRO12Mhz (the configuration before calling this function will be restored back) */
    uint32_t FLASHReadWaitStates        = CLOCK_GetFLASHAccessCycles();
    uint32_t core_sys_clk_configuration = CLOCK_GetCoreSysClkConfiguration();

    CLOCK_SetupFROClocking(kFreq_12MHz); // do we need a check here in case clock is lower than 12MHz?
    CLOCK_SetFLASHAccessCyclesForFreq(
        kFreq_12MHz); // only relevant when running from flash - is it worth the effort to switch this?

    // set excluded peripherals
    PMC->PDSLEEPCFG0 = pmc_sleepcfg0;

    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_POWERDOWN << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    cpu0_nmi_enable = SYSCON->NMISRC & SYSCON_NMISRC_NMIENCPU0_MASK; /* Save the configuration of the NMI Register */
    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK;                 /* Disable NMI of CPU0 */

    /*
     * Enable wake up interrupt.
     * Rational : we enable each interrupt (NVIC->ISER) that can wake up the CPU here (before the __disable_irq()
     * below): Hence, if an interrupt was pending and not treated before (for any reason), the CPU will jump to that
     *            interrupt handler before trying to enter the low power mode.
     *            VERY IMPORTANT : Also, any interrupt set in NVIC->ISER, even though __disable_irq(), will make the CPU
     *                             go out of the Deep Sleep mode.
     */
    uint32_t interrupt_enables0 = (uint32_t)(wakeup_interrupts & 0xFFFFFFFF);
    uint32_t interrupt_enables1 = (uint32_t)((wakeup_interrupts >> 32) & 0xFFFFFFFF);
    uint32_t wakeup_sources0    = interrupt_enables0;
    uint32_t wakeup_sources1    = interrupt_enables1;

    if (cpu_retention_ctrl)
    {
        if (wakeup_interrupts & kWAKEUP_BLE_SLP_TMR)
        {
            // replace sleep timer irq (23) by wakeup state transition irq (31)
            ANACTRL->BLE_CTRL = ANACTRL_BLE_CTRL_BLE_DST_INT_CLR_MASK; // and clear interrupt request flag to prevent
                                                                       // isr execution at wakeup
            interrupt_enables0 &= ~kWAKEUP_BLE_SLP_TMR;                // disable IRQ
            interrupt_enables0 |= kWAKEUP_WAKE_DSLP;                   // replace by state transition irq
        }
        PMC->RESETCAUSE = PMC->RESETCAUSE; // clear reset cause
    }

    /* But first save the configuration of the CPU interrupt set enable Registers */
    cpu0_int_enable_0 = NVIC->ISER[0];
    cpu0_int_enable_1 = NVIC->ISER[1];

    NVIC->ISER[0] = interrupt_enables0;
    NVIC->ISER[1] = interrupt_enables1;

    /* Enable wake-up sources */
    SYSCON->STARTER[0] = wakeup_sources0;
    SYSCON->STARTER[1] = wakeup_sources1;

    uint32_t g_savedPrimask = 0;

    /* Make sure DEEP POWER DOWN reset is disabled else PowerDown with cpu retention will still reset */
    PMC->RESETCTRL &= (~PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK);

    /* Disable all IRQs */
    g_savedPrimask = DisableGlobalIRQ();

    /*
     * From here :
     *  1 - If an interrupt that is enable occurs,
     *      the _WFI instruction will not be executed and we won't enter in POWER DOWN.
     *  2 - If an interrupt that is not enable occurs, there is no consequence neither
     *      on the execution of the low power mode nor on the behaviour of the CPU.
     */

    /* Enable boot remap feature if there is no retention */
    //	if (((p_lowpower_cfg->CPURETCTRL & LOWPOWER_CPURETCTRL_ENA_MASK) >> LOWPOWER_CPURETCTRL_ENA_INDEX) ==
    //			LOWPOWER_CPURETCTRL_ENA_DISABLE)
    //	{
    //		/* Retention mode is NOT enable : enable memory remap feature */
    //		SYSCON->MEMORYREMAP &= (~SYSCON_MEMORYREMAP_MAP_MASK); /* Vector Table in ROM */
    //	}

    /* Store BOD interrupt enables to be able to restore them later. */
    anactrl_bod_dcdc_int_ctrl = ANACTRL->BOD_DCDC_INT_CTRL;

    /* Disable the Flash, execute _WFI() instruction then enable the Flash after wake up event */
    CHIPLOWPOWER_PowerCycleCpuAndFlash();

    /* DISCLAIMER: THIS IS EXPERIMENTAL CODE. REMOVE IF THIS CAUSES PROBLEMS (HCIOT-2181). */
    /* Only clearing the bit is required as the PMC must have kept its state. */
    PMC->DCDC0 &= ~PMC_DCDC0_ENABLE_BYPASS_MASK;

    /*
     * We can reach this point for 2 reasons:
     * 1 - We are coming out from POWER DOWN mode with CPU state retention. Assumption is that the SRAM
     *     containing the stack used to call this function shall be preserved during low power.
     * 2 - We didn't enter the POWER DOWN mode because a wake up interrupt popped up just
     *     before entering the POWER DOWN mode (as a consequence, the WFI() has been ignored)
     */

    /* Disable boot remap feature.
     * This is required because it could be that the _WFI has not been executed (Power cycle is cancelled),
     */
    //	if (((p_lowpower_cfg->CPURETCTRL & LOWPOWER_CPURETCTRL_ENA_MASK) >> LOWPOWER_CPURETCTRL_ENA_INDEX) ==
    //			LOWPOWER_CPURETCTRL_ENA_DISABLE)
    //	{
    //		/* Vector Table in Flash */
    //		SYSCON->MEMORYREMAP =
    //				(SYSCON->MEMORYREMAP & (~SYSCON_MEMORYREMAP_MAP_MASK)) | SYSCON_MEMORYREMAP_MAP(2);
    //	}

    // restore main clock settings
    // restore flash wait cycles
    CLOCK_SetFLASHAccessCycles(
        FLASHReadWaitStates); // do we need a check here in case restored clock is lower than 12MHz?
    // restore System Clock
    CLOCK_SetCoreSysClkConfiguration(core_sys_clk_configuration);

    if (cpu_retention_ctrl)
    {
        POWER_RestorePinRegisters(); // pin registers are lost after PD with cpu retention
    }

    /* Enable all interrupts */
    EnableGlobalIRQ(g_savedPrimask);

