zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    /* Restore ACTIVE mode to allow using normal WFI again */
    PMC->CTRL = (PMC->CTRL & (~PMC_CTRL_LPMODE_MASK)) | (LOWPOWER_CTRL_LPMODE_ACTIVE << PMC_CTRL_LPMODE_SHIFT);

    /* Reset Sleep Postpone configuration */
    //	SYSCON->HARDWARESLEEP = 0;  todo

    /*** We'll reach this point in case of POWERDOWN with CPU retention or if the POWERDOWN has not been taken (for
      instance because an interrupt is pending). In case of CPU retention, assumption is that the SRAM containing the
      stack used to call this function shall be preserved during low power ***/

    /* Following code is to reset PUF to remove over consumption */
    /* Enable PUF register clock to access register */
    SYSCON->AHBCLKCTRLSET[2] = SYSCON_AHBCLKCTRL2_PUF_MASK;
    /* Release PUF reset */
    SYSCON->PRESETCTRLCLR[2] = SYSCON_PRESETCTRL2_PUF_RST_MASK;
    /* Enable PUF SRAM */
    PUF_SRAM_CTRL->CFG |= PUF_SRAM_CTRL_CFG_ENABLE_MASK | PUF_SRAM_CTRL_CFG_CKGATING_MASK;

    /* Disable PUF register clock. */
    // Delaying the line of code below until the PUF State Machine execution is completed:
    // Shutting down the clock too early will prevent the state machine from reaching the end.
    // => Wait for status bit in PUF Controller Registers before stop PUF clock.
    while (!(PUF_SRAM_CTRL->INT_STATUS & PUF_SRAM_CTRL_INT_STATUS_READY_MASK))
        ;
    SYSCON->AHBCLKCTRLCLR[2] = SYSCON_AHBCLKCTRL2_PUF_MASK;

    /* Restore the configuration of the NMI Register */
    SYSCON->NMISRC |= cpu0_nmi_enable;

    /* Restore the configuration of the CPU interrupt enable Registers (because they have been overwritten inside the
     * low power API */
    NVIC->ISER[0] = cpu0_int_enable_0;
    NVIC->ISER[1] = cpu0_int_enable_1;

    /* Restore BOD interrupt enables. */
    ANACTRL->BOD_DCDC_INT_CTRL = anactrl_bod_dcdc_int_ctrl;

    return kStatus_Success;
}

/**
 * PMC Deep Power Down function call: power down almost whole chip, reset/wakeup by pin, RTC or OS Timer
 */
status_t POWER_EnterDeepPowerDown(uint32_t exclude_from_pd, uint64_t wakeup_interrupts, uint32_t wakeup_io_ctrl)
{
    // check validity of inputs ...................................
    // 1. only the following peripherals can be excluded from deep power down:
    // kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPPOWERDOWN
    if (exclude_from_pd & ~kEXCLUDE_FROM_PD_LIMITATION_MASK_DEEPPOWERDOWN)
    {
        return kStatus_InvalidArgument;
    }
    // 2. some analog peripherals need to stay powered.  => assumed all done by hardware.
    // 3. some combinations are not allowed

    // 4. combinations with other registers:

    // 4.1 BOD resets: when enabled, BOD should stay powered
    uint32_t pmc_reset_ctrl = PMC->RESETCTRL;
    if (((pmc_reset_ctrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_SHIFT) ||
        ((pmc_reset_ctrl & PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD1RESETENA_SECURE_DP_SHIFT))
    {
        if (!(exclude_from_pd & kLOWPOWERCFG_BOD1))
        {
            return kStatus_InvalidArgument;
        }
    }
    if (((pmc_reset_ctrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_MASK) != 2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_SHIFT) ||
        ((pmc_reset_ctrl & PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_MASK) !=
         2U << PMC_RESETCTRL_BOD2RESETENA_SECURE_DP_SHIFT))
    {
        if (!(exclude_from_pd & kLOWPOWERCFG_BOD2))
        {
            return kStatus_InvalidArgument;
        }
    }

    // What about wakeup interrupts.  Allowed in DeepPowerDown are: kWAKEUP_RTC, kWAKEUP_OS_EVENT, kWAKEUP_WAKE_PAD
    if (wakeup_interrupts & ~(kWAKEUP_RTC | kWAKEUP_OS_EVENT | kWAKEUP_WAKE_PAD))
    {
        return kStatus_InvalidArgument;
    }

    // end check valid combinations ...................................

    status_t status = POWER_SetPowerConfiguration(kLP_MODE_DEEPPOWERDOWN, &exclude_from_pd);
    if (status != kStatus_Success)
    {
        return status;
    }

    if (wakeup_interrupts == kWAKEUP_RTC)
    {
        RTC->CTRL |=
            RTC_CTRL_WAKEDPD_EN_MASK; // only for Deep power-down mode - set this to get RESETCAUSE RTCRESET bit set
    }

    uint32_t pmc_sleepcfg0 = ~(exclude_from_pd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    // bias must be set to 0 V in deep power down, except BOD requires 0.63 V
    pmc_sleepcfg0 &= ~PMC_PDSLEEPCFG0_PDEN_BIAS_MASK; // clear bias bits
    if (exclude_from_pd & (kLOWPOWERCFG_DCDC | kLOWPOWERCFG_BOD1 | kLOWPOWERCFG_BOD2))
    {
        pmc_sleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_0_63;
        PMC->LDODIG |= PMC_LDODIG_VADJ_PWD_MASK;
    }
    else
    {
        pmc_sleepcfg0 |= PMC_PDSLEEPCFG0_PDEN_BIAS_DISABLED;
    }

    /* Switch System Clock to FRO12Mhz */
    CLOCK_SetupFROClocking(kFreq_12MHz);
    CLOCK_SetFLASHAccessCyclesForFreq(
        kFreq_12MHz); // only relevant when running from flash - is it worth the effort to switch this?

    // set excluded peripherals
    PMC->PDSLEEPCFG0 = pmc_sleepcfg0;

    PMC->CTRL = (LOWPOWER_CTRL_LPMODE_DEEPPOWERDOWN << PMC_CTRL_LPMODE_SHIFT) |
                (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_OFF << PMC_CTRL_POFFMODE_SHIFT);

    /*
     * Enable wake up interrupt.
     * Rational : we enable each interrupt (NVIC->ISER) that can wake up the CPU here (before the __disable_irq()
     * below): Hence, if an interrupt was pending and not treated before (for any reason), the CPU will jump to that
     *            interrupt handler before trying to enter the low power mode.
     *            VERY IMPORTANT : Also, any interrupt set in NVIC->ISER, even though __disable_irq(), will make the CPU
     *                             go out of the Deep Sleep mode.
     */
    NVIC->ISER[0] = (uint32_t)(wakeup_interrupts & 0xFFFFFFFF);
    NVIC->ISER[1] = (uint32_t)((wakeup_interrupts >> 32) & 0xFFFFFFFF);

    // exception for OSTIMER
    if (wakeup_interrupts & kWAKEUP_OS_EVENT)
    {
        PMC->OSTIMERr |= PMC_OSTIMER_DPDWAKEUPENABLE_MASK;
        wakeup_interrupts &= ~kWAKEUP_OS_EVENT;
    }

