zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
    /* Enable wake-up sources */
    SYSCON->STARTER[0] = (uint32_t)(wakeup_interrupts & 0xFFFFFFFF);
    SYSCON->STARTER[1] = (uint32_t)((wakeup_interrupts >> 32) & 0xFFFFFFFF);

    /* Configure wake-up by I/O */

    PMC->WAKEUPIOCTRL =
        wakeup_io_ctrl |
        PMC_WAKEUPIOCTRL_WAKEUPIO_RSTN_MASK; // include RSTN to generate WAKEIOCAUSE being set in RESETCAUSE reg

    /* Enable DEEP POWER DOWN reset */
    PMC->RESETCTRL |= PMC_RESETCTRL_DPDWAKEUPRESETENABLE_MASK;

    CHIPLOWPOWER_PowerCycleCpuAndFlash();

    return kStatus_Success; // never comes here - just to suppress compiler warning
}

/**
 * PMC Power Off function call: power down almost whole chip, reset/wake up by pin only
 */
status_t POWER_EnterPowerOff(uint32_t exclude_from_pd, uint32_t wakeup_io_ctrl)
{
    // check validity of inputs ...................................
    // 1. only the following peripherals can be excluded from power off:
    // kEXCLUDE_FROM_PD_LIMITATION_MASK_POWEROFF
    if (exclude_from_pd & ~kEXCLUDE_FROM_PD_LIMITATION_MASK_POWEROFF)
    {
        return kStatus_InvalidArgument;
    }
    // end check valid combinations

    status_t status = POWER_SetPowerConfiguration(kLP_MODE_POWEROFF, &exclude_from_pd);
    if (status != kStatus_Success)
    {
        return status;
    }

    // set excluded peripherals
    uint32_t pmc_sleepcfg0 = ~(exclude_from_pd & EXCLUDE_FROM_PD_TO_SLEEPCFG0_MASK);

    PMC->PDSLEEPCFG0 = pmc_sleepcfg0;

    SYSCON->NMISRC &= ~SYSCON_NMISRC_NMIENCPU0_MASK; /* Disable NMI of CPU0 */

    PMC->CTRL = (LOWPOWER_CTRL_SELCLOCK_1MHZ << PMC_CTRL_SELCLOCK_SHIFT) |
                (LOWPOWER_CTRL_POFFMODE_ON << PMC_CTRL_POFFMODE_SHIFT);

    /* Configure wake-up by I/O */
    PMC->WAKEUPIOCTRL = wakeup_io_ctrl;

    CHIPLOWPOWER_PowerCycleCpuAndFlash();

    return kStatus_Success; // never comes here - just to suppress compiler warning
}

/*!
 * @brief Function that returns the Supply Mode.
 * @return Supply Mode.
 */
dcdc_mode_t POWER_DCDC_GetSupplyMode(void)
{
    dcdc_mode_t mode;
    uint32_t aoreg1 = PMC->AOREG1;

    if (aoreg1 & kAOREG1_DCDC_MODE_XR_SM_SS_MASK)
    {
        mode = kDCDC_MODE_XR_SM_SS;
    }
    else if (aoreg1 & kAOREG1_DCDC_MODE_XR_SM_DS_MASK)
    {
        mode = kDCDC_MODE_XR_SM_DS;
    }
    else
    {
        /* relies on match between dcdc_mode_t and dcdc_hw_mode_t */
        mode = (dcdc_mode_t)((PMC->STATUSPWR & PMC_STATUSPWR_DCDCMODE_MASK) >> PMC_STATUSPWR_DCDCMODE_SHIFT);
    }
    return mode;
}

/*!
 * @brief Function that sets the Supply mode
 * @return status
 */
status_t POWER_DCDC_SetSupplyMode(dcdc_mode_t mode)
{
    status_t status = kStatus_Success;
    dcdc_hw_mode_t hw_dcdc_mode =
        (dcdc_hw_mode_t)((PMC->STATUSPWR & PMC_STATUSPWR_DCDCMODE_MASK) >> PMC_STATUSPWR_DCDCMODE_SHIFT);
    chip_version_t version = SYSTEM_GetChipVersion();

    if (mode == kDCDC_MODE_HV_SM)
    {
        /* Buck (HV), supported on A0, A1, A2, A3 and A4 */
        if (version <= kCHIPVERSION_A4)
        {
            /* Check if reported HW PMC mode matches with inputs*/
            if (mode == kDCDC_MODE_HV_SM)
            {
                if (hw_dcdc_mode != kDCDC_HW_MODE_HV_SM)
                {
                    return kStatus_Power_SupplyModeModeInvalid;
                }
            }
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    /* Boost (LV), supported on A0, A1, A2 and A5 */
    else if (mode == kDCDC_MODE_LV_SM)
    {
        if (version <= kCHIPVERSION_A2 || version == kCHIPVERSION_A5)
        {
            if (mode == kDCDC_MODE_LV_SM)
            {
                if (hw_dcdc_mode != kDCDC_HW_MODE_LV_SM)
                {
                    return kStatus_Power_SupplyModeModeInvalid;
                }
            }
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    /* External regulated single supply (XRSM SM), supported on A0, A1, A2, A3 and A4 */
    else if (mode == kDCDC_MODE_XR_SM_SS)
    {
        if (version <= kCHIPVERSION_A4)
        {
            if (version <= kCHIPVERSION_A2)
            {
                /* enable LPBS */
                PMC->DCDC0 |= PMC_DCDC0_ENABLE_BYPASS_MASK;
            }
            /* disable DCDC */
            POWER_DCDC_Disable();
            PMC->AOREG1 |= kAOREG1_DCDC_MODE_XR_SM_SS_MASK; // register reset on POR, BOD, to be set only once
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    /* External regulated dual supply (XRSM DM), supported on A0, A1, A2, A3 and A4 */
    else if (mode == kDCDC_MODE_XR_SM_DS)
    {
        if (version <= kCHIPVERSION_A4)
        {
            if (version == kCHIPVERSION_A4)
            {
                /* disable DCDC */
                POWER_DCDC_Disable();
            }
            PMC->AOREG1 |= kAOREG1_DCDC_MODE_XR_SM_DS_MASK; // register reset on POR, BOD, to be set only once
        }
        else
        {
            return kStatus_Power_SupplyModeModeNotSupported;
        }
    }
    else
    {
        return kStatus_Power_SupplyModeModeNotSupported;
    }
    return status;
}

/*!
 * @brief Function to disable DC/DC convertor. When the device is using an external supply mode, the DC/DC convertor
 * should be disabled. When supply mode is kDCDC_MODE_LV_SM , the DC/DC can be disabled but the flash subsystem can't be
 * used. All code needs to run from RAM. When supply mode is kDCDC_MODE_HV_SM , the DCDC can't be disabled.
 */
void POWER_DCDC_Disable(void)
{
    POWER_PeripheralPowerOff(kPOWERCFG_DCDC);
}

/*!
 * @brief Function to enable DC/DC convertor.
 */
void POWER_DCDC_Enable(void)
{
    POWER_PeripheralPowerOn(kPOWERCFG_DCDC);
}

/*!
 * @brief Function to configure output level of DC/DC convertor when configured in buck mode.
 * @pre Can only be used supply mode kDCDC_MODE_HV_SM is used.
 * @param output_lvl    The output level of the DC/DC convertor.
 */
void POWER_DCDC_ConfigureBuckOutput(dcdc_buck_output_level_t output_lvl)
{
    PMC->DCDC0 = (PMC->DCDC0 & ~PMC_DCDC0_VOLTAGE_MASK) | output_lvl << PMC_DCDC0_VOLTAGE_SHIFT;
}

/*!
 * @brief Function to configure output level of DC/DC convertor when configured in boost mode.
 * @pre Can only be used supply mode kDCDC_MODE_LV_SM is used.
 * @param output_lvl    The output level of the DC/DC convertor.
 */
void POWER_DCDC_ConfigureBoostOutput(dcdc_boost_output_level_t output_lvl)
{
    PMC->DCDC0 = (PMC->DCDC0 & ~PMC_DCDC0_VOLTAGE_MASK) | output_lvl << PMC_DCDC0_VOLTAGE_SHIFT;
}

/*!
 * @brief Function to retrieve the time it took for the DC/DC to have stable output level. Note that the measurement
 * circuit saturates at 0xFFFF (65535 us). The times it takes for the DC/DC to stabilize the output can be used to fine
 * tune the BLE wake up timer. The BLE stack needs to enable 'correction' of the BLE wakeup timer based on how long it
 * takes for the DC/DC to stabilize.
 * @return value that indicates how long it took for DC/DC convertor to have a stable output in us.
 */
uint16_t POWER_DCDC_GetStartupDuration(void)
{
    return (uint16_t)((PMC->STATUSPWR & PMC_STATUSPWR_DURATION_MASK) >> PMC_STATUSPWR_DURATION_SHIFT);
}

/* Get power lib version */
/*!
 * brief Power Library API to return the library version.
 *
 * param none
 * return version number of the power library
 */
uint32_t POWER_GetLibVersion(void)
{
    return FSL_MCXW23_POWER_CONTROL_VERSION;
}

/*!
 * @brief Function to configure the detection level of BOD1.
 * @param level      BOD1 detect level
 * @post             BOD1 is configured to kBOD_NO_ACTION
 * @post             this call must be followed by POWER_ConfigureBOD1() if reset or interrupt is required
 */
void POWER_SetBod1Level(bod_level_t level)
{
    POWER_ConfigureBOD1(kBOD_NO_ACTION);
    /* The BOD mode does not work as expected and the accuracy of the threshold is not good enough. [HCIOT-3939]
     * So we always use level detect mode and use the hysteresis to trim the level based on data stored in NMPA. */
    PMC->BOD1 = AdjustedLevelRegisterSetting(
        level, (FLASH_NMPA->BOD & FLASH_NMPA_BOD_BOD1_TRIGLVL_MASK) >> FLASH_NMPA_BOD_BOD1_TRIGLVL_SHIFT);
}

/*!
 * @brief Function to configure the detection level of BOD2.
 * @param level      BOD2 detect level
 * @post             BOD2 is configured to kBOD_NO_ACTION
 * @post             this call must be followed by POWER_ConfigureBOD2() if reset or interrupt is required
 */
void POWER_SetBod2Level(bod_level_t level)
{
    POWER_ConfigureBOD2(kBOD_NO_ACTION);
    /* The BOD mode does not work as expected and the accuracy of the threshold is not good enough. [HCIOT-3939]
     * So we always use level detect mode and use the hysteresis to trim the level based on data stored in NMPA. */
    PMC->BOD2 = AdjustedLevelRegisterSetting(
        level, (FLASH_NMPA->BOD & FLASH_NMPA_BOD_BOD2_TRIGLVL_MASK) >> FLASH_NMPA_BOD_BOD2_TRIGLVL_SHIFT);
}

/*!
 * @brief Function to configure the BOD1 action. Note that BOD is disabled automatically when BOD reset is triggered but
 * the settings remain.
 * @param action     the action to take when a BOD is detected
 */
void POWER_ConfigureBOD1(bod_action_t action)
{
    switch (action)
    {
        case kBOD_INTERRUPT:
            DisableBOD1Resets();
            EnableBOD1Interrupts();
            break;
        case kBOD_RESET:
            DisableBOD1Interrupts();
            EnableBOD1Resets();
            break;
        default: /* This includes kBOD_NO_ACTION */
            DisableBOD1Interrupts();
            DisableBOD1Resets();
            break;
    }
}

/*!
 * @brief Function to configure the BOD2 action. Note that BOD is disabled automatically when BOD reset is triggered but
 * the settings remain.
 * @param action     the action to take when a BOD is detected
 */
void POWER_ConfigureBOD2(bod_action_t action)
{
    switch (action)
    {
        case kBOD_INTERRUPT:
            DisableBOD2Resets();
            EnableBOD2Interrupts();
            break;
        case kBOD_RESET:
            DisableBOD2Interrupts();
            EnableBOD2Resets();
            break;
        default: /* This includes kBOD_NO_ACTION */
            DisableBOD2Interrupts();
            DisableBOD2Resets();
            break;
    }
}

/*!
 * @brief Function to clear the BOD1 interrupt. It does not
 *        clear the interrupt in the NVIC.
 */
void POWER_ClearBOD1Interrupt(void)
{
    uint32_t int_ctrl = ANACTRL->BOD_DCDC_INT_CTRL;
    int_ctrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD1_INT_CLEAR_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = int_ctrl;
}

/*!
 * @brief Function to clear the BOD2 interrupt. It does not
 *        clear the interrupt in the NVIC.
 */
void POWER_ClearBOD2Interrupt(void)
{
    uint32_t int_ctrl = ANACTRL->BOD_DCDC_INT_CTRL;
    int_ctrl |= ANACTRL_BOD_DCDC_INT_CTRL_BOD2_INT_CLEAR_MASK;
    ANACTRL->BOD_DCDC_INT_CTRL = int_ctrl;
}

/*!
 * @brief Function to retrieve the BOD1 status.
 * @return true as long as BOD1 detects a voltage below the threshold
 */
bool POWER_IsBOD1Active(void)
{
    return ((ANACTRL->BOD_DCDC_INT_STATUS & ANACTRL_BOD_DCDC_INT_STATUS_BOD1_VAL_MASK) == 0);
}

/*!
 * @brief Function to retrieve the BOD2 status.
 * @return true as long as BOD2 detects a voltage below the threshold
 */
bool POWER_IsBOD2Active(void)
{
    return ((ANACTRL->BOD_DCDC_INT_STATUS & ANACTRL_BOD_DCDC_INT_STATUS_BOD2_VAL_MASK) == 0);
}

/*!
 * @brief Function to retrieve the reset cause.
 * @pre	   only valid when coming from DEEP POWER DOWN
 * @return reset cause register content when it was saved by bootloader - only significant bits
 */
reset_cause_t POWER_GetResetCause(void)
{
    return (reset_cause_t)((PMC->AOREG1 >> 4) & 0xfff); // match with bootloader implementation
}

/*!
 * @brief Function to configure the caps of the 32KHz xtal
 * @param capIn The capIn setting
 * @param capOut The capOut setting
 */
void POWER_XTAL32K_ConfigureCaps(uint8_t capIn, uint8_t capOut)
{
    uint32_t val = PMC->XTAL32K;
    val &= ~(PMC_XTAL32K_CAP_OSCIN_MASK | PMC_XTAL32K_CAP_OSCOUT_MASK);
    val |= ((uint32_t)capIn << PMC_XTAL32K_CAP_OSCIN_SHIFT) | ((uint32_t)capOut << PMC_XTAL32K_CAP_OSCOUT_SHIFT);
    PMC->XTAL32K = val;
}

void POWER_XTAL32K_ConfigureReferenceOutputCurrent(uint8_t gm)
{
    uint32_t val = PMC->XTAL32K;
    val &= ~(PMC_XTAL32K_GM_MASK);
    val |= ((uint32_t)gm << PMC_XTAL32K_GM_SHIFT);
    PMC->XTAL32K = val;
}

void POWER_XTAL32K_ConfigureOscillatorAmplitude(uint8_t ampl)
{
    uint32_t val = PMC->XTAL32K;
    val &= ~(PMC_XTAL32K_AMPL_MASK);
    val |= ((uint32_t)ampl << PMC_XTAL32K_AMPL_SHIFT);
    PMC->XTAL32K = val;
}

void POWER_XTAL32K_EnableBypass(bool enable)
{
    if (enable)
    {
        POWER_PeripheralPowerOn(kPOWERCFG_XTAL32K);
        PMC->XTAL32K |= 1UL << PMC_XTAL32K_XTM_SHIFT;
        POWER_XTAL32K_ConfigureCaps(0, 0);
    }
    else
    {
        PMC->XTAL32K &= ~(1UL << PMC_XTAL32K_XTM_SHIFT);
    }
}

