zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXW/MCXW236/fsl_power_lib/fsl_power_lib.c
void POWER_XTAL32M_BLE_GateEnable(bool enable)
{
    if (enable)
    {
        // ungate BLE clock - gate-on the BLE-PHY cko16 to BLE-LL aclk
        PMC->XTALBLE |= PMC_XTALBLE_CKO_UNGATE_OVERRULE_MASK;
    }
    else
    {
        PMC->XTALBLE &= ~PMC_XTALBLE_CKO_UNGATE_OVERRULE_MASK;
    }
}

status_t POWER_XTAL32M_SetStartupTime(uint8_t startupTime)
{
    status_t status = kStatus_InvalidArgument;
    if (startupTime > 0 && startupTime <= 15)
    {
        PMC->TIMEOUT = (PMC->TIMEOUT & ~PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_MASK) |
                       (startupTime << PMC_TIMEOUT_BLE_RESTART_OSCEN_TIME_OUT_SHIFT);
        status = kStatus_Success;
    }
    return status;
}

/**
 * Measure the voltage on Vbat_hv using BOD1.
 *
 * Normal operation of BOD1 is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
status_t POWER_MeasureVoltageWithBod1(uint32_t *voltage)
{
    return MeasureVoltage(0, voltage);
}

/**
 * Measure the voltage on Vbat_hv using BOD2.
 *
 * Normal operation of BOD2 is suspended during the conversion.
 * Voltage must remain stable during conversion in order to get accurate results
 * Note that WDT_BOD_IRQn is disabled during the measurement but is restored afterwards.
 *
 * @param voltage pointer to variable that'll hold the measured voltage in millivolts
 * @return kStatus_Success in case of success.
 */
status_t POWER_MeasureVoltageWithBod2(uint32_t *voltage)
{
    return MeasureVoltage(1, voltage);
}
